{"train_0": ["Customer enquired about his Iphone and Apple watch which is not showing his any steps/activity and health activities.", "Agent is asking to move to DM and look into it."], "train_1": ["Customer is eager to know about the replacement policy on the earphones he wishes to buy.", "Agent stated that it only applies if the received item is defective or damaged."], "train_2": ["Signed up for an AmexCard with Delta but it didn't go through.", "Told to phone the new accounts team."], "train_3": ["The customer have a problem.", "The agent is very cordial and offers to follow up on the case."], "train_4": ["Customer cannot purchase a train ticket on the rail providers site since the revamp.", "Will report the issue to the development team."], "train_5": ["The client is visibly upset with the service.", "The agent cannot help the customer."], "train_6": ["Tesco's website is badly set up and crashing a person's computer.", "The agent asks for intrusive personal details to log the problem which the customer refuses to provide  so the agent does not do anything helpful at all."], "train_7": ["Customer is enquiry about the latest android version of samsung.", "Agent inform that they will going to update once samsung updates."], "train_8": ["Customer is asking whether he needs to install Xbox live membership if he buy a digital code.", "Agent updated that there is no need of Xbox live gold subscription if they purchase a digital game."], "train_9": ["Customer wants to change address ordered items are shipped to, and it only updated for 2 out of 3 items.", "The third items is with a seller on the site who will need a bit longer to respond and do the update."], "train_10": ["Customer bought a tin of biscuits and the use by date was old.", "Wants a photo of the tin and date and how much they cost then they'll explain what happens next."], "train_11": ["The customer has a big problem and is visibly upset about it.", "The agent tries to handle the situation in the most professional way possible."], "train_12": ["Wants to know the time of the next train because the info board at the station is just showing delayed.", "Gives the time of the required train and will report the fault of the display board."], "train_13": ["The customer have a big problem.", "The agent tried to solve the problem and offers choices to the customer."], "train_14": ["Flight delayed due to crew fighting, the company not keeping customers updated with expected departure time.", "Provides an estimated departure time but only as the customer is boarding so would have that information already."], "train_15": ["Amazon pantry order was delayed by 7 days but refund is being held up.", "Looking into the problem."], "train_16": ["Customer bought prime membership with a gift card and wants to know if he is eligible for the cashback offer.", "Offers a link to a secure place to look into this issue."], "train_17": ["Customer is visibly frustrated at not getting enough variety.", "The agent tries to deal with the client in the best way."], "train_18": ["The customer has a problem with the website.", "The agent tries to solve the problem but in the end must escalate it to a higher level."], "train_19": ["Someone else has taken their bag after a flight and left their own similar case and wants to know when BA will contact the customer, also asks when they can make an insurance claim.", "Says that BA will not take any steps to contact the person to return the mistaken bag and that the customer could contact the police and report their bag stolen."], "train_20": ["Customer is complaining about the money deducted from his/her card.", "Agent stated that they will connect through phone and resolve the issue."], "train_21": ["Needs instructions on how to configure the vpn gateway.", "Someone will respond through the forum."], "train_22": ["The client has many questions.", "The agent answers all questions even if they are not problems to solve."], "train_23": ["Update to the phone means customer cannot reply to messages without first closing them and the apple store he went to couldn't solve it and recommended a hard reset.", "Offers to take the issue into DM to work with the customer to solve the problem."], "train_24": ["Customer is asking to repair or change the television which is not working.", "Agent updated to return the television with their credit/debit card."], "train_25": ["Had flickering issues on Dell laptop when he moved it.", "Advises running Dell diagnostics."], "train_26": ["Pre ordered the iPhone x but there are none available.", "Explains availability depends on exact model chosen and advises for this customer delivery date is 20th Dec."], "train_27": ["Customer is asking about the denied transaction at the ATM he faced.", "Agent is requesting to know the right time to call the customer."], "train_28": ["Customer enquired that Touch pad is not working after Fall creator update.", "Agent updated to contact Answer Desk Team for resolving the issue."], "train_29": ["Word freezing after a Microsoft update.", "A link to repairing an office application."], "train_30": ["Customer arrived fifteen minutes early to pick up a package and was told it was unknown when the package would be ready for pick up.", "Agent asked which store gave the poor service and did the customer ever receive his package."], "train_31": ["Customer enquired about the episodes of season 7 missing.", "Agent updated that episode 7 will try to checkout to re-add for the future."], "train_32": ["An item was attempted to be delivered but Amazon said refused delivery and customer wants to know if it will be redelivred.", "No order details can be accessed on social media."], "train_33": ["Downloading speed is very slow in the Eleweran area.", "Tells customer to select £G (which customer doesn't see in list) same with WCDMA setting."], "train_34": ["Win10 updated caused a BSOD error on laptop.", "Provided a link to resolve the blue screen error - and it worked!"], "train_35": ["COD WWII was pre-ordered to arrive on day of release but had not arrived.", "Items can be sent same day (but it didn't arrive, useless help so hard to put a good response in here)."], "train_36": ["Customer identified niece as a male in error.", "Agent has corrected nieces title to female."], "train_37": ["V5 had an image service which is missing from the dashboard on V7.", "Can't find an answer but billing dept may be able to help."], "train_38": ["The customer needed help but figured it out.", "The agent wanted to know if there was still a problem and if there was an error code."], "train_39": ["The customer have a question.", "The agent solve the question and offer alternative solution."], "train_40": ["Customer complaining about 5 hours trip turned into 15 hours and also having  to spend extra $400.", "Agent  telling that we had to take a closer look for u give us a follow and dm with your record locator."], "train_41": ["Customer is questioning after upgrading their phone, so far they have received 11 emails and 5 texts confirming various bits.", "Agent updates to DM them a screenshot of the messages they have received."], "train_42": ["Here customer is asking for the help as he has replaced his new device  few days before and still waiting  to get it replaced and still no response from the service company and also he wants best quality product for which he already paid 1200 .", "Here agent note downs the issues and tells him to DM for better solution and stay connected  and also they responded to the issues."], "train_43": ["Customer is complaining about the delayed journey by 1hr 30mins.", "Agent states that the compensation can be claimed if the delay is over an hour."], "train_44": ["Customer is complaining about the stacking orders and batched orders and demanding to have an option to tip the courier whenever he need it.", "Agent requests to DM the email address and states that tip can be add anytime  and for some reason if tipping screen is closed, they will add the tip manually."], "train_45": ["Customer is complaining that 3 trains got missed due to no parking space.", "Agent asked to reduce the parking so that there will be improvement and issue can be done with."], "train_46": ["Customer is complains about No service and still the issue is not resolved.", "Agent updated the customer to send the DM for further assist."], "train_47": ["Customer is unable to search flight by using discount code.", "Agent informs customer to check with search features which may restrict."], "train_48": ["Customer is requesting for assistance in replacing the line.", "Agent requests for the name, ID number, last airtime top up and 3 frequently dialed numbers."], "train_49": ["Customer is complaining that there is an ONT in the basement that send a loud beep evry 15 mins and they do not have any service.", "Agent updates that they can unplug it and remove the battery forever since they do not have service wth them, when battery is dead, the beeping will automatically stops."], "train_50": ["Customer is complaining about unresolved issue as the date of departure is nearing.", "Agent requests for more time and assures to keep the customer updated once it is done."], "train_51": ["Customer is asking help to Port in.", "Agent updates to DM  their contact number and pincode and tells that their team  will surely contact them for further assistance and requests to wait for some time."], "train_52": ["Customer complains that though he had paid for tickets he is unable to receive it because of out of service and asking for refund.", "Agent suggested to contact dedicated smart card team for further assistance."], "train_53": ["Customer is complaining about the service, that after the cancellation of the flight due to crew being illegal, they have rebooked, paid extra and paid interest still got no service.", "Agent updates to DM them once they arrive and they will be happy to review the entire situation."], "train_54": ["Customer is facing issue with his controller as vibarator not working while playing Destiny 2.", "Agent provides with an URL  to check with settings still being disabled."], "train_55": ["Customer is asking to cancel the order because he picked the wrong size.", "Agent suggests that all the sizes on the UK website are in UK sizes."], "train_56": ["Customer is unable to connect Bluetooth to his car.", "Agent asked what happens when connected and informed to DM them with  location,So that they can gather more information for better troubleshoot."], "train_57": ["Customer wants to quit the contract for charging higher bill even after removing TU app.", "Agent requests to try other alternatives like WiFi calling and other 3rd party apps."], "train_58": ["Customer having an issue that the staff at the gate can't board us because the seat map won't match and also customer wants the amount to be refund.", "Agent asked the customer shall i cancel the reservation and process a refund for both passengers and inform the customer that hey cannot offer a refund on a flight that they will fly."], "train_59": ["Customer is asking is there any chance of getting the complaints procedure today.", "Agent updates since they do not have escalation  options on Twitter, they are welcome to contact customer support ask for a supervisor."], "train_60": ["Customer is complaining about the FIFA points which they never got them.", "Agent replied that they have Direct Message them via twitter with further instructions."], "train_61": ["The customer is asking to change the language from gujarati to marathi.", "The agent asked to call to 12345 or 198 regarding their concern."], "train_62": ["Customer is complaining about email were messeges are rearly send and they have blocked the email.", "Agent says to go to the URL and follow the steps to unblock."], "train_63": ["Customer is enquiring about the trains which does not have any problem for couple of days.", "Agent says that they are not expecting any problem tomorrow but anything changes our website will be updated."], "train_64": ["Customer is complaining about paying fee for free service.", "Agent is requesting for more details about the issue."], "train_65": ["The customer is asking that how to  import my tunes smart playlists to spotify.", "The agent updated that they will let their devs know that something they would like to see and asked to dm accounts username and email address."], "train_66": ["Customer is asking about  the routes of the pdf files.", "Agent says typekit troubleshooting article:URL."], "train_67": ["Customer is complaining about the network extender issue where extender will replicate existing SSIDs for some days then again it will changed to random default SSIDs.", "Agent asks to factory reset both extender and router at a time and states both SSID names/passwords will be deleted."], "train_68": ["Customer is complaining about the food service provided like chips was not served with queso.", "Agent updated that the customer needs to order specifically."], "train_69": ["Customer complaining about supervisor he is not customer focus.", "Agent replying that he care for his experience  and asking is he  need  any assistance with rebooking."], "train_70": ["The customer is complaining that they were about to purchase call of duty ww2 since yesterday but credit card and paypal keeps coming up invalid.", "The agent asked to follow them and chat with them via direct message."], "train_71": ["The customer asks the billing manager to call as he was facing issue with service.", "The agent replies that the issue cannot be resolved since the customer was already interacting with another and asks to DM and follow."], "train_72": ["Customer is accusing of violating the privacy contracts and suggests to review it.", "Agent sates to check a link if want to review the privacy practices."], "train_73": ["The customer is complaining that the n1500 todat to subscribe to data has disappeared.", "The agent updated that as that #1500 was used for bb unlimited bundle for 3g as seen on check and asked to dail *140# to confirm their balance."], "train_74": ["Customer is complaining about the failure to update the app and asks how to turn off the alerts.", "Agent updates that if they are still receiving those alerts then let's move to DM so that they can check with few more settings."], "train_75": ["Customer is stating an issue that it is unable to connect hdmi cable to the tv.", "Agent has provided the URL as asked to follow the steps given in the link  for black screen."], "train_76": ["Customer is complaining that his flight set a different time in talwan today and can't connect the flight in KL today.", "Agent updated that they have forwarded it to the relevant team for flight move accordingly."], "train_77": ["The customer asks whether the delays be resolved and asks whether the reservation is still valid.", "The agent replies the tickets are still valid and the customer can travel with that."], "train_78": ["Customer ordered a laptop from 3rd party seller and they sent the laptop but its lack of features disappointed him.", "Agent updated that we will allow seller's 2 business days to reply and informed the customer to update once he get resolution with the seller."], "train_79": ["Customer is enquiring that is their any problems in this morning booking a delivery slot.", "Agent suggests to clear cache and cookies and he would like to report  issue with  his technical team."], "train_80": ["The customer is complaining that after every tdm match, tthey getting back to the lobby.", "The agent asked to share nat type and their gamertag."], "train_81": ["The customer is complaining that they found a snail shell in garden peas.", "The agent asked to send a pic of the barcode and to dm nectar card number via this link and get a refund added."], "train_82": ["The customer is complaining that he can't able cast his app and tv.", "The agent responded that the devices need to connect to the home network and asked them dm."], "train_83": ["Customer is asking how to elevate his status when the link is not working.", "Agent replies that the portal to elevate their status which will be  available on December 1st through 11:59 pm."], "train_84": ["Customer is complaining about the allergen warning which they have mentioned as it is suitable for vegans where it contains milk.", "Agent replied that the mistake was from their end."], "train_85": ["Customer is asking which is the easiest way to arrive from Orly airport to intercontinental Paris Le Grand.", "Agent replies for more information customer can directly contact hotel with the given Contact details or can email at given email address."], "train_86": ["Customer is complaining that they are unable to use their iPhone with a new update of apple ios 11.1 and this issue is been chatted with 5 advisors which couldn't protect their personal data to be preserved.", "Agent updates to join in DM to have a closer look into this issue."], "train_87": ["Customer complains on cafe for unavailability of particular ordered food.", "Agent assures and has been escalated to manager to internal review."], "train_88": ["Customer complains about the gift cards which is not suitable for the loyal customers.", "Agent replied that not receiving the delivery will be inconvenient and said the resolution which is provided is a fair one."], "train_89": ["Customer is complaining about the WiFi start page and the usual bbc news way of doing it no longer works.", "Agent says to try forgetting the network in settings, reconnect &amp then follow the link again and will managed to connect."], "train_90": ["Customer is not able to open the bill.", "Agent updated that they are working on it and they will resolved at earliest."], "train_91": ["Customer is complaining about the online selling super off peak tickets where the tickets are not valid and tells that misleading customers with fare availability.", "Agent updates that they can recreate this issue when booking there and the team will look into this issue and will get back to them if they have requested a call back."], "train_92": ["The customer is complaining that his iphone was not at all charging.", "The agent asked to dm to look at the service options together."], "train_93": ["The customer is asking that can they upgrade their seats.", "The agent updated that they were afraid to promise but can able to best to contact the train manager to see something they can do."], "train_94": ["The customer asks why can't he listen to all songs, in a playlist folder on mobile and adds that it happened sometime after a recent update on Android.", "The agent asks does logging out, restarting the device, and logging back in help to resolve the issue and asks to DM customer's account's username and email address to assist further on the issue."], "train_95": ["Customer is asking that salisbury train from waterloo.", "Agent updated that he was giving information more detailed, running a railway often gas a lot more to it than it appears."], "train_96": ["Customer is complaining that they can't find a box of chocolate orange segments that was use for baking and asks whether they have discontinued them.", "Agent updates that they have stopped selling them and however if they DM their name and address, it will help them to bring this item back."], "train_97": ["Customer is complaining that his luggage has been delayed.", "Agent says that the miles should be posted within 48 hours."], "train_98": ["Customer has some issue with logging into the Spotify app after installing the latest version.", "Agent requests for screenshots for more details and requests for the personal details. Also suggests to reinstall after restarting the device."], "train_99": ["Customer is complaining that they have issue with the grocery app where its not loading and says \"oops something went wrong\" and have tried using another handset but still facing same issue.", "Agent apologies because these were the fixes they had and requests to DM their name, address, device and version of the app so that they can look into this."], "train_100": ["Customer is complaining that reception and customer service lack.", "Agent updated that when connected to wifi customers will make calls and access data."], "train_101": ["Customer is complaining about the issue with the service after the previous update and states that didn't get any help visiting the support page.", "Agent suggests to update the carrier settings and requests to check out the article he shared to resolve the issue."], "train_102": ["Customer is complaining about the reminder calls on paying the bills and wants to disconnect the service.", "Agent states that they are offering special waiver and requests to continue the service."], "train_103": ["Customer wants to know how he can fill the claim for luggage that was damaged in the flight.", "Agent asked the customer to bring the damage luggage to the baggage service office."], "train_104": ["Customer is complaining  about the iPhone  which has not yet delivered.", "Agent says all orders sent out as quickly as  possibly can."], "train_105": ["The customer says that he need a direct flight from #BDL to #PITT #SteelerNation and asks to add a few points to his account.", "The agent says that they may not have a direct flight but they can get him there and adds that he totally deserve the upgrade and requests to enjoy the flight back to home."], "train_106": ["Customer is complaining that the even after the payment is done the number is not activated and customer needs assurance before making a payment.", "Agent updated that the number is inactive due to not making a payment."], "train_107": ["The customer is complaining that they haven't receive 100% bonus.", "The agent updated that 100% bonus data has been added to the data plan."], "train_108": ["The customer is asking for the policy of the swipe and sign cards as its been refused twice for him from the store.", "Agent is asking for store details the customer visits and added that that they do accept the Visa/Mastercard gift cards."], "train_109": ["Customer is complaining the issue of battery drain.", "Agent updated the customer to install the new version of iOS i.e, 11.0.3."], "train_110": ["Customer is complaining that the window need to be fixed in seat 1A on flight 2433 to MYS from ATL.", "Agent updates that this complaint has been reported to the flight attendant."], "train_111": ["Customer is requesting to assist about the game where they were able to install all the DLC but DLC is not popping up on their game and not sure that they need to reach a certain point in th game to unlock them.", "Agent updates to try uninstalling the game, power cycling and reinstalling."], "train_112": ["Customer is complaining about not receiving the food ordered.", "Agent updated that they will speak with management and inform the customer to DM."], "train_113": ["Customer complains about missing armrest in his seat.", "Agents compensate by offering 4000 bonus miles getting credited to customers SkyMiles account."], "train_114": ["The customer informs that #PowerfulAnswers were not received and adds that the patient care not compromised.", "The agent asks to DM to assist further to get the issue resolved."], "train_115": ["Customer is complaining about mobile network service.", "Agents informs that his engineers are working on issue."], "train_116": ["Customer is facing problem in connecting dot and voice remote to access video.", "Agent request to troubleshoot with reference to URL."], "train_117": ["Customer is complaining that from 8 days without cell service because his phone is locked to t-mobile, although it fully own the phone.", "Agent updated that they had DM an damp they will work with there to get more info on this matter."], "train_118": ["The customer says that it contains multiple songs on spotify, the first three minutes is the song in the title, after that a very long pause and more songs.", "The agent asks to send them the URL or link of the similar tracks the customer is referring to and says that they have given their content team a nudge about it and also that they are passing the feedback."], "train_119": ["Customer is complaining that they have connecting flights in CLT that they left less than hour for.", "Agent updated that they have backed up on the next flight out just in case."], "train_120": ["Customer is complaining that they found a slug when they cut a cauliflower.", "Agent apologizes for this and updates that they can issue a refund  if they send DM with full name and addres."], "train_121": ["The customer is complaining that the app not letting them to sign in or register and says they have already registered but they haven't done it before.", "The agent asked them that whether they forget the password if so they will send it via \"request my password\" and asked them dm their name, address."], "train_122": ["Customer is complaining about rotten apple.", "Agent requests for the date and barcode of the product and would pass back onto the supplier."], "train_123": ["Customer is complaining about voiceover issue.", "Agent suggests to log in by restarting the device."], "train_124": ["Customer is complaining that there is a 2G network from where he is tweeting and since the issue is reporting from past 1.5 years it remains same yet.", "Agent apologised for the inconvenience and asked the customer to share contact number to assist better."], "train_125": ["Customer has restart his phone but unable to make an update.", "Agent updated to DM and provided URL for the further assistance."], "train_126": ["The customer is complaining that some of the channels are missing.", "The agent asked to swap two of the boxes and see the problem persists and if so asked to dm them+."], "train_127": ["Customer is enquiring about Reserved return ticket of airline which she have not receive yet.", "Here agent is asking an apology and booking the seat with the customer name."], "train_128": ["Customer is complaining about the expired bread but still buying by other customers.", "Agent updated to send the DM them with some details."], "train_129": ["Customer is questioning where to submit bugs for recent NRC app on Apple watch.", "Agent updates that they have passed the feedback along to their team."], "train_130": ["The customer says that he would have been allowed for check in since he was delayed by only 5 minutes.", "The agent replies that any customer wouldn't be allowed for check-ins if arrived after check in is closed and it applies to all of their customers."], "train_131": ["Customer is praising a conductor for the politeness with his service.", "Agent states that he passed on the feedback to their manager."], "train_132": ["Customer is complaining about the delay in flight for an hour and not holding any connection.", "Agent updates to send their confirmation number over in DM so that they can have a closer look into the issue."], "train_133": ["Customer missed his flight needs  refund.", "Agent informs customer if he needs refund of his ticket they can request from their Virgin rep."], "train_134": ["Customer is complaining about the inaccuracy of GPS in the NRC app.", "Agent requests to test it out by holding the phone in hand or in an armband."], "train_135": ["The customer is asking about flight delay.", "The agent confronting the customer saying that there was a mechanical problem so the flight was delayed."], "train_136": ["Customer is complaining about customer service for not picking up the calls.", "Agents informed that during that time high call volume and asked to allow just few minutes to review the messages."], "train_137": ["Customer is unable to cancel  booking from his android mobile.", "Agent informed customer that they will check on it."], "train_138": ["The customer is telling they wants to buy an item but the seller is not delivering to her address and he is asking to change her PO Box address which she can't.", "Agent is responding that the seller will not be having an option to block the PO Box and also informing that he have replied with more info on that issue."], "train_139": ["Customer is complaining about the inconvenience of train delay appears.", "Agent apologised for the inconvenience and provided compensation via URL."], "train_140": ["Customer is complaining that they don't whether its windows 10 but it's not allowing to transfer photos from phone to their pc since 2 window updates.", "Agent updates to DM more about the issue so that they can look more into the issue to resolve it."], "train_141": ["Customer is enquiring about how long it will take to switch to idea network.", "Agent updated the customer to visit nearest idea store for further assist and also inform that if the number is does not get active please write us back."], "train_142": ["The customer says his iPhone 7 plus is on 11.1 and iPhone X is 11.0.1 so it won't restore from his backup and his SIM card not activated which can't be done over cellular.", "The agent asks to DM and says to contact them over a link provided by them to the customer."], "train_143": ["Customer enquires that he purchased LR5 in july 2013, subscribed to cc in nov 2013 and stopped cc last month but now he cannot use develop mode.", "Agent states that LR5 can be used if machine is compatible and also requests that they will message them to  Adobe ID(Email) for further assistance."], "train_144": ["Customer is complaining about rescheduling of his flights and fears of missing his scheduled naval carrier journey.", "Agent assures to connect with the rest of the flight by getting customer on a flight to Seattle. Also states that would assist to reroute the luggage."], "train_145": ["Customer is enquiring about winners list of oneplus 5T.", "Agent informed the customer that to visit their page to check the winner details once results are out."], "train_146": ["Customer is complaining about delayed delivery from 3 days.", "Agent states that it is the busiest time of the year and requests to report it over a provided URL."], "train_147": ["Customer complaints on product shipped to wrong address.", "Agent ask the customer to DM for further assistance."], "train_148": ["Customer is complaining about  flight door handle broken his carryon.", "Agent is replying that take a damaged bag to baggage service as  they will review the damages."], "train_149": ["Customer wants to reschedule the flight from Perth to earlier flights than 4:30 pm.", "Agent states about other flights between 6:50 and 11:35, and requests to check the availability by sharing an URL."], "train_150": ["Customer is complaining about the service.", "Agent updated the customer to DM with email address,some details of what's going on and what options they can help out."], "train_151": ["Customer is complaining about not being able to use the ticket for return journey.", "Agent states that it gets cancelled if the onward journey has not made."], "train_152": ["The customer is asking for the Uber's Dubai office number and emails to reach to solve some issues.", "The agent replies that they don't offer phone support for these issues and asks to send them a note via link provided by them."], "train_153": ["Customer inquiring about flight cheeked  in and out in the terminal.", "Agent suggests customer  the booking information ."], "train_154": ["Customer complaining about restricting limits in speed and how it will be helping for lower wage families.", "Agent updated that he will take his feedback seriously and  he will pass his feedback on to the loyalty department."], "train_155": ["The customer is complaining that why their bootcamp is not working.", "The agent asked to follow the steps to install windows with boot camp."], "train_156": ["Customer is complaining about the computer which stopped working after updating and can't even contact customer support on their laptop or phone.", "Agent requests to run the Surface  Diagnostic Toolkit to check for possible corrupted files in the given URL."], "train_157": ["Customer complains about charging for change in booking.", "Agent informs to customers that he will email a letter with points that he discussed."], "train_158": ["Customer is complaining about the delayed delivery of a product.", "Agent is inquiring whether the customer had contacted USPS directly for an update."], "train_159": ["The customer says that he is an existing customer of the bank, he tried calling to the bank several times but he didn't get any service from the bank.", "The agent asks to complete the required details in the provided link to escalate the issue further and asks to provide the phone number in order to assist further on the issue."], "train_160": ["Customer has complained that he is unable to travel with brand new sealed laptop without unboxing it.", "Agent is glad that customer has reached him for this issue."], "train_161": ["Customer request to turn down the  A/C in the quite carriage G.", "Agent directs customer to speak to station staff to validate his ticket for the next service."], "train_162": ["Customer is complaining about after the newest update reputation album has completely disappear from my music.", "Agent asking were u able to locate and download the album again to your device."], "train_163": ["Customer is having an issue that Spotify starts up on windows 10 even though it is disabled.", "Agent asked for the version and informed to send the feedback to the right folks and updated to DM  the username and email address."], "train_164": ["Customer is complaining about delayed refund of a cancelled flight for over a month.", "Agent requests to reach out customer care by providing their contact number."], "train_165": ["Here customer is complaining about some issue occurred in an app where he cant even text.", "Here agent ask the details and note the issue and says to  the customer that they will send this report to expert and get it resolve and also send a link where he can find a proper solution."], "train_166": ["The customer complains that AmericanAir is unable to link the mobile app with the upgrade list at the gate, the standby list was empty and employees blamed the systems and last minute ticket purchase as the reason.", "The agent says that the customer should be able to view the standby and upgrade list via provided link and says that they are glad to see that their folks were able to get him upgraded."], "train_167": ["Customer is enquiring about why the Price variation for the same journey but different dates.", "Agent informed that Pricing does vary on advance tickets as they are first come first serve,So when the cheaper tickets have sold only standard fares remain."], "train_168": ["Customer is complaining about the customer service.", "Agent updated the customer to provide confirmation number via DM, So that they will look on this issue."], "train_169": ["Customer is inquiring about buying options for apple watches on the same day since he didn't find it in the local store.", "Agent shares a link to find the nearest stores and also suggests to try ordering online or via telesales department."], "train_170": ["Customer is complaining about the contacted seller twice but their are ignoring the mails.", "Agent responded to make sure to check it for more information."], "train_171": ["Customer is asking that why they have charged him for the returned product and wanting to resolve the issue sooner.", "Agent asked back customer to DM his account number and to do so further asked to follow their page."], "train_172": ["Customer is having an issue with typography of microsoft site showing an errors.", "Agent updated to provide the screenshot and  asked the customer what troubleshooting steps have done on particular issue."], "train_173": ["Customer is having an isssue that spotify app keeps on randomly turning on and off.", "Agent asked the android version and informed that they will look backstage."], "train_174": ["Customer  is facing frequent crashes on  his new safari 11.", "Agent request customer to try testing the issue in safe mode in given URL."], "train_175": ["Customer asking that who is in the  office morning  and how about the stopping services.", "Agent replying that there are some engineering works ongoing today  and also one hour running between Poole and basing stoke."], "train_176": ["Customer enquires that the code which she received while doing a online shopping was not working.", "Agent requested to DM them for further assistance."], "train_177": ["Customer is complaining on the incorrect courier facility.", "Agent asked customer not to share order details with anyone as it is considered as personal information and updated that order will be shipped ASAP."], "train_178": ["Customer is questioning can they spend money in 2017 for the travel in 2018 to qualify the 2018 status and trying to hit their MQD's by the end of the year.", "Agent updates that they can purchase the tickets on their platinum delta sky miles american express credit card to reach the MQD waiver and the other way is to spend $25000 on thei delta amex within end of the year."], "train_179": ["Customer is asking that are children allowed to sign up for rapid rewards.", "Agent updated that several families have the same address associated with multiple accounts."], "train_180": ["The customer is complaining that whenever is trying turn on wifi or hit on retry button he is getting kicked off from the wifi.", "The agent asked the customer to dm for further assistance."], "train_181": ["Customer is complaining why is his download stuck on 4.599 GB.", "Agent updated that to follow them and send them a DM ."], "train_182": ["The customer says that he is been trying to transfer service since last month and adds that he didn't received military discounts.", "The agent asks whether the customer attempting to upgrade the speed and shares a link to check on the discounts."], "train_183": ["Customer is complaining about the bug in the Spotify webpage.", "Agent states their Artist support team would assist and requests to get in touch with them."], "train_184": ["Customer complaints that an update on the 9:31 Bham to Manchester Piccadilly which says delayed.", "Agent updates that the service they are on is currently expected to arrive at Manchester Picadilly at 11:32."], "train_185": ["Customer is asking to refund his amount from @VirginTrains.", "Agent asks to take mail address and they will search their  system for anything they can find and also to DM."], "train_186": ["Customer is complaining about cancelled trip due to situation in PR.", "Agent updated the customer to send the confirmation number and informed the customer that they miles as been redeposited and refunded 11.20$ per person."], "train_187": ["Customer is complaining about the virgin trains and 2 to 3 trains journey with the seat reserved  &amp , somebody sat in it refusing to move.", "Agents says that will be passing it on to the customer experience managers, if you want to write can do via:URL."], "train_188": ["Customer having an issue with GalaxyNote8 not working with 123765 and even on 9242.", "Agent updated the customer to clear the cache and data and then try again and also updated that to uninstall the app and downloading it again."], "train_189": ["The customer is complaining that they stood 5 mins with their suitcase abd briefcase at the gate and nobody was there to help them out.", "The agent apologizes for any rudeness happened."], "train_190": ["Customer is placing a complain on internet issue.", "Agent asked the customer about the battery back up and to try again with network."], "train_191": ["Customer is complaining about that they are requested to close this account 4 months back and still i am being charged.", "Agent request to visit nearest idea store for disconnection after clearing the outstanding amount."], "train_192": ["Customer is requesting to help them in troubleshooting the problem where their iPhone SE's personal hotspot menu has been got for several weeks.", "Agent asks for the details and updates to meet in DM to have a closer look into this issue."], "train_193": ["Customers wants to know if there are any other solutions because they have already send a complaint about surface but didn't get any answer.", "Agent recommended to visit the nearest store in their area to check their device. Store personnel with evaluate their surface device and will be able to provide them recommendations."], "train_194": ["Customer is complaining that the things he buys will remain broken always and to replace it with a faulty bike he used to spent 30 euro for the taxi.", "Agent apologised for not proving a quality product and updated to DM the details."], "train_195": ["The customer is complaining that why can't they watch the episode of their choice.", "The agent told that clicking on a show brings up the details and just to the right is episodes, which has all seasons."], "train_196": ["Customer enquires about the cancellation of tickets and also asking how to apply for refund.", "Agent states that once the booking is confirm, cancellation is not allowed."], "train_197": ["Customer is complaining about customer service.", "Agent states that they don't have great offers."], "train_198": ["Customer is enquiring about upgrade without paying upfront cost.", "Agent informed that it depends on what contract you choose to upgrade onto and  asked whether he spoke with upgrade team  regarding offer and finally inform to pay for the same."], "train_199": ["Customer complaining about yesterday s ride was awful and running late with dangerous driver.", "Agent suggests that please report  this to our critical response line  and also feel free to send this through our help center ticket request from url."], "train_200": ["Customer unconfirmed seats after he  has booked a tickets.", "Agent has explaining about revised timetable of network train u and hoping the customer about the booking once he gets confirmation."], "train_201": ["The customer says that the spectrum is not using automated system anymore.", "The agent says spectrum is currently working with Viacom to continue providing channels."], "train_202": ["The customer says that he is unable to connect to the internet, he is going to be restarting every time with no solution, he says that he is getting \"Unable to connect to the Internet, Please try again later\" when he restarts and tries to subscribe again.", "The agent says that the line profile on their end is ok and suggests to restart handset then to try different sites to browse to test and asks to check DM."], "train_203": ["Customer is asking about the email received with the confirmation of my pre order of payback delux edition  but don't no where the code is.", "Agent says they should receive another e-mail lettering when the contest is actually avail, with a similar link."], "train_204": ["Customer is complaining that they want to leave the property that does not have power for days where they are trying to tax their donation and they will keep until their employee is either moved to another location or their money is 100% refunded so that they can go to hotel.", "Agent updates that they can see their case manager is in touch with them via mail regarding on the refund and provides an URL for more information."], "train_205": ["Customer is complaining about the horrible service which hanged phone on their face.", "Agent updates to provide the details along with their tracking number and their contact phone and requests to DM using the given link for further assistance."], "train_206": ["Customer is complaining about the low stock.", "Agent asks to DM their full name, email address and full home address details of account."], "train_207": ["Customer is complaining that he is unable to login into his Verizon account with the correct information.", "Agent suggests to reset the password if the website is advising about locked out credentials."], "train_208": ["Customer is complaining that no cashback as been added to his bank account.", "Agent updated that when they pop into store with it they will be more than happy to help."], "train_209": ["Customer is complaining about the music keep pausing everytime.", "Agent updated that to delete the snapchat app and restarting the device then reinstalling the app and also informed the customer to DM with the result."], "train_210": ["Customer lost his contacts on Windows phone and  can still see on his PC.", "Agent directs customer to remove photo which contains  customers email address and send them a DM for further questions."], "train_211": ["Customer is  enquiring that as he has own the season pass (on xbox and ps4), he has not recieved the login bonus on ps4.", "Agent is requesting to provide Gamertag and PSN id and also states that the reset will be done at 5pm PST."], "train_212": ["Customer is complaining that last week they allowed thief too run away and poor language and fights.", "Agent update that they had fed this details to the relevant department for further investigation."], "train_213": ["Customer inquiring about differences b/w flight miles & other miles.", "Agent provided necessary  information n ask the customer skyline no for further assistance."], "train_214": ["Customer is complaining about the menu in the hotel.", "Agent replied the this issue is forwarded to hotel management and concern parties for future reference."], "train_215": ["Customer need access for Lucinda calligraphy and center page in layout.", "Agent provides an URL to know more about Word Online."], "train_216": ["Customer complaints that they will  try and recall them if they have much better app before.", "Agent updates that they have sent them more info on this issue via DM and requests to continue over chatting."], "train_217": ["Customer is complaining why do they need premium to shuffle one direction and the app is not working while trying to listen to one direction.", "Agent updates to DM their account's mail address or username so that they can look at the backstage to solve this issue."], "train_218": ["Customer is enquiring about the offered and wants to upgrade the same.", "Agent informed that they will check and updated that they are facing some technical issue on website."], "train_219": ["Customer is complaining about the delay of 1 1/2 hours which is messing up their schedule in Orlando.", "Agent updates the new departure time is 956am and their customer advocacy team will reach out to them with compensation."], "train_220": ["Customer complains that he has been asked to Re-book flight ticket for being late.", "Agent informs customer that he has been charged accurately and refund cannot be offered on luggage."], "train_221": ["Customer enquiring why do he update the survivor picture but not episodes.", "Agent replying that  he also seeing imagery on their end and generally he show the thumbnail of most current season."], "train_222": ["Customer is complaining about not been replied to his emails.", "Agent informed that there customer relations work on cases in order of date received and asked regarding case reference and informed to DM the email address."], "train_223": ["The customer asks why a customer was sent with confirmation email saying its done and request is closed.", "The agent informs that migration process is in progress, and requests to visit the same idea store where he have applied for further assistance and also to share his idea contact details."], "train_224": ["Customer is complaining about the bugs in the software.", "Agent states that he will escalate the account to their tech team."], "train_225": ["Customer is complaining that how come there no longer stocking pineapple, passion fruit and mango squash.", "Agent updated that they had a checked and that product is currently on hold."], "train_226": ["Customer is having an issue with no service and signal  is available.", "Agent updated that to send DM so that they will work on it."], "train_227": ["Customer complains about adobe programming.", "Agent is suggesting customer check  with help of url link as agent will assist you.."], "train_228": ["Customer is complaining about the multiple mapping caused by  onedrive in windows 10 makes 115890 removing recent places.", "Agent asks to improve their twitter support by answering survey on the link:URL."], "train_229": ["Customer complaints about parcel being delivered to his neighbour when he was in home.", "Agent informs customer to contact on given URL."], "train_230": ["Customer is complaining about the inconvenient customer service like no water, no sleep etc. Due to the cancellation of flight 200 customers are waiting for a single BA post and needed to book a taxi as well.", "Agent apologised for the inconvenience and updated they will forward the feedback to airport manager."], "train_231": ["Customer is complaining about tesco expressin brackley not taking 1 coins .", "Agent informed that they are informed the store already and next time it will not happen again."], "train_232": ["Customer is complaining that they can't get on earlier leaving with empty seats and asks how much money will make off an empty seat.", "Agent apologies for the inconvenience and updates that they will have them on their way as soon as they can."], "train_233": ["Customer is complaining about the inconvenience of unavailable first class seats and asking is there no value of purchased tix.", "Agent informed that customer has no value remain to apply for first class and further informed about the service charges amount and said that comfort+ seats are available."], "train_234": ["Customer is complaining about the expired food item he bought at the store.", "Agent is requesting for the receipt, product and date information, name, email id and postcode to record the issue."], "train_235": ["Customer is complaining that after many hours of troubleshooting still can not access apple music playlists on his iphone.", "Agent suggest him to DM if they would like to move forward with them so they can help in any way ."], "train_236": ["Customer is complaining about delayed flights to MIA.", "Agent states it's due to repairing the water leak and are ready to resume the flight."], "train_237": ["Customer updating that free trails in live TV garbage always skips and is always buffering.", "Agent asking what  device are you streaming from and  are he getting same issue while  streaming from iPhone."], "train_238": ["Customer complains about issue with sprint care social network.", "Agent updated the customer to  DM for for further assistance."], "train_239": ["Customer is asking how to disallow external users like outside users sharepoint  site.", "Agent is replying that we look in to it  and we found some documentation that help with this url."], "train_240": ["Customer is frustrated that delivery is not has been done on time even after paying and estimation of the product.", "Agent apologised for the delay and given the URL to be in touch with to make delivery of parcel."], "train_241": ["Customer is requesting to help where the site is not allowing them to purchase for that date.", "Agent updates that they don't have any estimated date to go on sale, they do refresh the advance fares every Friday so they advised them to keep an eye on the website."], "train_242": ["Customer is complaining that he is unable to play songs in Apple music and has subscribed to the service for more than 2 years.", "Agent wants to know if the customer is using Wi-Fi or cellular data and whether the customer faced this issue in the past."], "train_243": ["Customer inquiring a mis connection in check in timing of a flight .", "Agent has clearing the doubts of a customer providing necessary l information."], "train_244": ["Customer complaining that internet and fios down  for 5 hours when message told it would be on in 1 hour.", "Agent telling that internet and tv are down right now and we will try to reset battery backup unit  which will trigger a reset to main network terminal  if the services not back sign  in with your credentials  check outages at this url."], "train_245": ["Customer is complaining about the service which makes him wait 1 hour to get bag  at DFW.", "Agent  updated the customer to see baggage team member to check and inform to call their team at 800-535-5225."], "train_246": ["Customer inquiring regarding deal on sales  of xbox.", "Agent provided needful information  to the customer."], "train_247": ["Customer asking is there any age range for the child's in the parent child's bays.", "Agent updating that there isn't really an age limit for children in our parent child facilities."], "train_248": ["Customer informed that they want to change the bank as the current bank is charging unnecessary amount.", "Agent send the link to customer and ask for providing name,zip and phone number best time to call."], "train_249": ["Customer is complaning that modem is not connected.", "Agent is suggests to submit a request  to have the power to the lines using URL."], "train_250": ["Customer is requesting to tell them where has stock of the hulk buster at 9.99.", "Agent updates that all store are saying to order now and to collect in 3 days and they will be getting it back in stock."], "train_251": ["The customer is complaining that their tv was skipping and its supports chrome cast from android.", "The agent asked to reboot the device once along with the router or modem."], "train_252": ["Customer asking to stop cancelling  all his flights and go back to having good customer service.", "Agent is updated that he will work to get to his destination asap and reach out to his reservation agents for any help."], "train_253": ["Customer is complaining about the poor service where they changed their flight and lost boarding position A to C and wouldn't let them $ for priority boarding during check in.", "Agent updates that their Gate agents have the ability to offer Upgraded boarding when available within one hour of departure and apologies for their continued frustration."], "train_254": ["Customer is complaining about the service down.", "Agent updated that there is some sort of an issue with a line outline."], "train_255": ["Customer is asking for help that how to remove clients on his diary view.", "Agent updated that to delete his tweet in the meantime as it contains sensitive  information."], "train_256": ["The customer is disappointed since he could not travel back to ORD since the Delta couldn't get him to EWR because of which he could not fly.", "The agent apologises and says that they will serve him better in the future."], "train_257": ["Customer complaining that show reverts  to the segment  just  watched after the ads.", "Agent suggests that uninstalling /reinstalling app doesn't help please reach out by phone or chat using URL."], "train_258": ["Customer asking about to check in as it said due to balanced due.", "Agent says to go the link need URL need to login in into the airasia account from pymt or it can be done at the counter before the flight."], "train_259": ["Customer is enquiring about buying a xfinity modem for someone.", "Agent sent an URL to customer so that the customer can learn which device is approved and also informed to sent DM to into further."], "train_260": ["The customer says that the headphone he brought has a price drop one day later from the day he bought so can he get any discount voucher on that.", "The agent asks whether the order has been dispatched and says that they won't offer price match so they wouldn't be able to issue any refunds."], "train_261": ["Customer is complaining about the new lost property procedures where nobody knows what to do and has to wait for 24 hrs since they have left the laptop on the flight down from Edinburgh.", "Agent apologies for the problems they have with lost property and for the inconvenience of being without their laptop."], "train_262": ["Customer is enquiring about why he is not listed for first class upgrade.", "Agent informed that they just added to first class wait list for his eligible flight."], "train_263": ["Customer is complaining about the Spotify where they are unable to play more than one song without pausing on its own and this is going on for a month now.", "Agent updates to send the details they have asked including their account email and for the spotify version, they can check it on their app's settings."], "train_264": ["The customer is complaining that music was not playing.", "The agent asked for a screenshot regarding the error and asks them to dm account email address or username."], "train_265": ["Customer is complaining about elevators which are not under working condition quite often.", "Agent states that they are currently being repaired by an engineer and they will get into working ASAP."], "train_266": ["Customer complaining about slowness in chrome cast.", "Agent suggest to logging out and restart his device and also asking to dm account email address or username."], "train_267": ["The customer says that the song \"Hello\" on the SEVENTEEN album Teen, Age isn't available to play and asks whether there is any specific reason for that.", "The agent asks to share the spotify link and asks which OS and the spotify version the customer was using."], "train_268": ["The customer asks how to get verified in the spotify.", "The agent asks whether the customer have an artist page up on spotify and asks the customer to request the access to spotify for Artist via link provided."], "train_269": ["Customer enquirers about changes in bundle offer price from $165 to $198.", "Agent informs customer that issue has been shared with account specialist and an update has been requested."], "train_270": ["Customer wants to cancel his trip and upgrade to full plan.", "Agent informed that as long as yoy don't cancel the trip it automatically converted into an annual or monthly and informed that the case has been sent to their specialist team in order to assist."], "train_271": ["The customer asks when will the Reduced Mileage Codes become available for December and January since the December was less than a week away.", "The agent says that there's not a set date or time, it's based on what seats are available and asks to contact Reservations through provided number to assist further on the issue."], "train_272": ["Customer wants to apply for a basic card online and needs online application form.", "Agent provides with URL link."], "train_273": ["Customer is questioning why was$40 taken from their bank earier this morning when they only go to stoke and back.", "Agent advises to speak with the station team regarding this so that they can help them to solve the issue."], "train_274": ["The customer is complaining that he is facing internet outtage issue.", "The agent asked the customer tosend an update to the modem to see if it responds and it will reboot if they do that so."], "train_275": ["Customer is enquiring about extend a flight ticket.", "Agent updated that changes can be done via Manage My booking up to 48 hours before the flight time ."], "train_276": ["Customer is complaining about the seat ticket request policy where they locked their seats and forced them to go to counter and wait for the ticket.", "Agent updates that it was their company's operational and security policy and their airport employees have to take control of the flights and also updates that it was not an insult but it was just the information provided."], "train_277": ["Customer is complaining that he can't save his downloaded  song to his storage device even its available.", "Agent updated him that they will take a look backstage."], "train_278": ["Customer is complaining about the delayed in the flight and missing in connection.", "Agent asks to DM their confirmation code through:URL."], "train_279": ["Customer is complaining about the app which is not working properly.", "Agent states that the complaint has been registered and they would assist soon."], "train_280": ["Customer wants to order grocery online.", "Agent is comforming the day when orderwill  be placed."], "train_281": ["Customer is complaining about the lost property where they have left their toilet bag with all their makeup on the train home to Edinburgh.", "Agent updates that it would terminate at Euston so that they need to leave a message with lost property and they will call back if the property is found."], "train_282": ["Customer complains that he is unable to upgrade as suggested by the app.", "Agent states that match the price with another company and they will offer the best at the time of upgrading."], "train_283": ["Customer asks to get their crap together with showing upcoming episodes that recently aired.", "Agent says to share  feedback about this their team."], "train_284": ["The customer says that he don't have the free data but he have used up to 100mb plus #300 worth of call card and asks why he has been charged 1 naira per mb.", "The agent asks to provide the customer's number and says that if the customer did not get the sms, it means he was not qualified and asks to restart the phone and redial to the provided number to get the issue resolved."], "train_285": ["Customer is complaining that the ticket $430 \"amp and know its double $709.", "Agent updated him to check different dates to see if the fare maybe lower."], "train_286": ["Customer having an issue with apps freeze and crashes consistently.", "Agent updated the customer to DM the account's email address or username for look into the issue."], "train_287": ["Customer is having some issue with service.", "Agent informed to DM the customer, So that they can have an agent to help."], "train_288": ["The customer asks whether the flight AK 377 Bali to KL cancelled since he got the text message regarding that and adds that the dates are confusing.", "The agent asks to provide booking number and informs that the flight is cancelled and suggests to opt for Free Flight Change, Credit Shell or Refund."], "train_289": ["Customer is complaining about auto lock feature for not working.", "Agent is inquiring whether the iPhone connected to wall outlet or a computer."], "train_290": ["Customer complains that unusual behavior of the staff on the sainburys.", "Agent updated the customer to  DM for further assistance."], "train_291": ["Customer is enquiring about the ads which he payed for not to have ads.", "Agent says to  to payback does not resume after the ads breaks, follow up here URL so can take a closer look."], "train_292": ["Customer is complaining that their tracking numbers are not porting over from Paypal, and got dinged on 10/20 shipment that was upload, they even uploaded on time but paypal did not send the tracking to ebay.", "Agent updates to DM their item umber, mail address, first/last name and postal code on file."], "train_293": ["The customer says that he is trying to figure out why he is not eligible for Chelsea contest when he received an email invite, and says that he wasn't apprised until entry period ended.", "The agent asks whether the customer is till having trouble in entering the Chelsea contest and informs that the contest ended on 160OCTth."], "train_294": ["The customer is asaking that the flight on 6th nov ak6044 schedule changed and asks for a help to check late flight after ak6044.", "The agent updated that there is no option available as the retime is only 35 minutes and asked manage my booking if they want for applicable fees."], "train_295": ["Customer is complaining about the credit back in Ww2 which was robbed.", "Agent apologised and informed general game timing."], "train_296": ["Customer complaint about facing an issue while exporting aPPro seq in AME.", "Agent request customer to check with AME settings."], "train_297": ["The customer is complaining that he can't see the map of the route even when geo localization is activated.", "The agent asked the customer to logout the nrc app and to restart the device once and to log in back once again."], "train_298": ["Customer is complaining about the internet speed of idea network in Gurgaon.", "Agent updates to provide alternative number to assist further on this issue."], "train_299": ["Customer is complaining that the wi fi gets crash for every 20 mins and shows the red light blinking.", "Agent is confirming about the light blinks is of internet connection lights of router which shows loss of connection."], "train_300": ["Customer enquirers how to recharge mobile on Amazon app.", "Agent informed customer that he will forward his feedback to the team concerned for review."], "train_301": ["Customer is complaining about the new iOS 11.1 is glitchy.", "Agent updated that to take a look at this article about using the new iTunes."], "train_302": ["Customer is complaining about lack of first class carriage.", "Agent asked  the journey details and informed they have first weened upgrade for 7.50 each way."], "train_303": ["Customer is complaining about the horrible service they got in Flagstaff.", "Agent updates to to DM their zipcode and they will check it out on this."], "train_304": ["The customer asks how does the BankAmeriDeals works and says that he added one and used it but nothing is showing up as earned.", "The agent informs that it will take 3-5 days from the purchase date before the transaction in their system and it takes up to 7 days from the purchase date before the credit displays on customer's earned tab."], "train_305": ["Customer is complaining about the delay of the train where in they didn't informed prior.", "Agent provided the link to check the information about the timings hence they got the information just the train departed from Chesterfield."], "train_306": ["The customer is complaining that the train was too late and delay.", "The agent apologizes and asks him to take for the next train."], "train_307": ["Customer is complaining that they are too much husks in their organic oats and thinks that this maybe the quality control issue.", "Agent updates to Dm their details so that they can fed back to their suppliers for review and also asks what would they prefer when they sent a moneycard refund via post or email."], "train_308": ["Customer is complaining about constantly freezing of the phone.", "Agent asked that the latest version software installed and informed that drop a DM and so that they run through it."], "train_309": ["The customer is asking thatcan they jump to 18:34 train with their 18:04 tickets as they thought its a direct train.", "The agent updated that of course no problems boarding the next direct train at 18:34."], "train_310": ["Customer is complaining about the delay of the flight where the agent didn't allow him to change his original flight.", "Agent apologized and states that the crew team will try to cover as much as time consumed while landing to ORD."], "train_311": ["Customer requests to take off the promotional sticker on the lunch deal since the discounts are not applied.", "Agent states that those discounts are for different item and requests to look for the red stripping and tickets that say meal deal on."], "train_312": ["Customer asking is there a reason why all endurance drills this weeks are 45 minutes.", "Agent is asking that is this his first week of training and also inform that please perform this week and keep up the loop for his next week looks the same."], "train_313": ["Customer having trouble with signal of mini box.", "Agent updated the customer to  DM for further assistance."], "train_314": ["Customer esquire about  creating internal subnet.", "Agent ask for further assistance as issue has been resolved by customer himself."], "train_315": ["The customer is complaining that why can't they send videos to android users.", "The agent asked to restart the device and to dm them to know about more."], "train_316": ["Customer is complaining about the delayed delivery and false email about failed attempt to deliver.", "Agent is stating that they had some issues with the scheduled delivery but will be delivered on the next day."], "train_317": ["Customer seems cola was the nicest drink and want to bring it back at christmas festival time.", "Agent updated that they cannot promise as they are not confirmed to release it and also informed they will inform it to the food team."], "train_318": ["Customer is complaining about the issue with Cortana search box and tried running SFC and DISM health.", "Agent is suggesting to contact their technical support team to look for other options for resolving the issue."], "train_319": ["The customer is asking about the availability of chevron skirt.", "The agent updated about the  skirt availability of required size."], "train_320": ["Customer is asking about the shipment of the ordered package and complaining for the delay of delivery.", "Agent updated that the package will be released and asked to DM for further assistance."], "train_321": ["Customer enquires about iPhone which he wants to buy.", "Agent provided the link to check for offers and ask to reach out them at anytime."], "train_322": ["Customer is having an issue with setting up outlook 2016.", "Agent informed to send an screenshot of the error message for checking the issue."], "train_323": ["Customer is asking a reason why an update is destroying their computer.", "Agent updates to get back if needed for further assistance."], "train_324": ["The customer is complaining that thye face extreme noise while travelling.", "The agent updated that they will surely pass comments regarding that."], "train_325": ["Customer enquires about the bookings which he had made with @AmericanAir instead of booking with @British_Airways.", "Agent states that the changes will be discuss over the phone itself."], "train_326": ["The customer is complaining that these girl songs beat got changed and it's more high pitched now.", "The asked for the phone model, operating system and spotify version he his using."], "train_327": ["Customer is complaining about 44% hike in the bill without any notice.", "Agent states that he would speak to one of their billing specialist."], "train_328": ["Customer is complaining that just paid to reserve seats as seat planner showing 4 window seats left after paying 20+ windows seats are available.", "Agent updated that seat selection will always show those available at the time."], "train_329": ["Customer complaining about the technician for not arriving to repair the equipment.", "Agent assures that they would provide best appointments that are available."], "train_330": ["Customer is complaining about the Groove on W10 mobile which is refusing to add music to their library still after 2 years.", "Agent suggests to contact the Answer Desk Support for more details  through the given link."], "train_331": ["Customer is complaining about the missing  delivery.", "Agent asks whether currently they have issue with a delivery."], "train_332": ["Customer is enquiring about travelling details can they join the train at Rugby.", "Agent asked the customer what sort of ticket and service they catching and inform the customer that not all departures from Euston to conventry stop at Rugby."], "train_333": ["Here customer is unhappy  with the service of sky club  where flight get delay and he gets the late notification.", "Here agent ask the customer to message him and ask for the location."], "train_334": ["Customer is complaining that their Sprint account has been labelled as Fraudulent for a year and they found this today when they went to buy a new phone.", "Agent updates that once the name change process is completed everything will be fine."], "train_335": ["Customer is enquiring about the item which is not available currently.", "Agent informed that they don't know the date of this item is due to come back into stock and informed that they will log and asked about the item."], "train_336": ["Customer is complaining that they are not getting points even after adding 100 $ on their account and its an american id and they have a Saudi arabia game.", "Agent updates that the region  of the game should match with the region in their account then the DLC will work fine."], "train_337": ["The customer is complaining that he reserved the seat but he didn't got it.", "The agent confronted the customer that they will let their web team to know about it."], "train_338": ["Customer is complaining about the website literally going back and fore.", "Agent updated that they had reported it and get back to them after a while."], "train_339": ["Customer is complaining about making payment without using the card.", "Agent is requesting for the username and email address."], "train_340": ["Customer was wondering to put lock on  my luggage that can check in to go under the plane or can not have a lock on it and also can bring laptop on the plane to watch movies on my laptop.", "Agent says with regards to the padlock we'd recommend you take  a TSA approved lock."], "train_341": ["Customer has booked for a wrong flight. since the US office is closed wanted someone to assist and also want to know about the credit shell.", "Agent asked about the booking number from the customer and informed that since the payment is non refundable has provide URL for further assistance."], "train_342": ["Here customer is facing some issue after updating the apple support app  who is using iphone6.", "Here agent note down the issues and sends a link where the customer can message him for the better solution."], "train_343": ["Customer is facing internet and cable service down in his area.", "Agent informs customer to schedule an appointment once outage is resolved."], "train_344": ["The customer is complaining that even though they have plugged in everything it says they have no coax connection.", "The agent asked to dm them even the issue persists."], "train_345": ["Customer asking to turn up the volume on the edge channel.", "Agent asking that having problems in all channels or just one channel and suggest to disconnect the coax from the back of the box and recoonect."], "train_346": ["Customer is asking whether their iPhone X will be delivered on Friday and if not when its expected to be delivered.", "Agent updates that they have replied to their private message and that's all the information they have."], "train_347": ["Customer is complaining that he had got the pumpkin pumeler and i cant equip it and its said they have to unlocked the normal variant first.", "Agent updated that to clear the system cache."], "train_348": ["The customer says that he reached the cross point cafe at 15.14pm with his son and they did not get the hot drinks out there and they were been told that they are cleaning the hot drinks machine.", "The agent asks at what time the cafe sign says it closes and asks to DM the full name and address of the customer to register the complaint in their internal system for future use."], "train_349": ["The customer says he wants to upgrade his iPhone online but the screen has a small crack and he likes to trade in his phone.", "The agent asks whether the customer has some insurance to the device and adds that they cannot use his device as trade in device."], "train_350": ["Customer is complaining about the connection server error.", "Agents asks to try setting up scan to E-mail again, using HP software wizard in windows follow:URL."], "train_351": ["Customer is inquiring about product delivery confirmation.", "Agent informs customer to keep posted about delivery."], "train_352": ["Customer is having an issue with SpotifyCares app.", "Agent informed to send the IOS ,App version and the song link and finally updated to send DM with account's email address or username."], "train_353": ["The customer asks why the frozen peas were not available in the store.", "The agent replies unfortunately they do not store frozen peas but they do store only tinned peas."], "train_354": ["Customer is complaining that been trying to access his account online for over a month but unable promised call back non received.", "Agent updated they will have a word with the team for him and find out whats going on ."], "train_355": ["Ther customer says there was not even sufficient packing material and says there is a damage.", "The agent asks the customer to contact them if there id any damage to the product and says to reach out to the third party since it was sole by them."], "train_356": ["The customer is complaining that a staff was shouting for hanging up his suit.", "The agent apologizes and told they expect their agents to be helpful and professional at all times."], "train_357": ["Customer wants to know about better data packs for his mobile.", "Agents states that they don't offer price match service and would offer best available deals."], "train_358": ["Customer wants to know will there be still disruptions at 8 pm from Euston to Stockport.", "Agent updates that the services are now slowly resuming, and advises to check with station staff before getting on a train."], "train_359": ["Customer is complaining about installing 4k content on xbox one x.", "Agent states that there is no feature to pre-install but requests to check for ready to install list."], "train_360": ["Customer is complaining about the poor signals on the ESPN network.", "Agent requests for the name, zip code and the service address for better assistance."], "train_361": ["The customer is complaining that when he tried to access to store it just has the please wait loading screen.", "The agent asked the customer to rebuild the database and able to fix the issue."], "train_362": ["Customer complaints about delay in flight.", "Agent informs customer to DM his confirmation number."], "train_363": ["Customer is complaining that he needs technician who can fix the box where HD channels comes with picture quality.", "Agent updated that they will work on it to resolve the isuue."], "train_364": ["Customer is disappointing about service protection policy fro direct TV and the service provider.", "Agent asking more information about what happening and also telling that it took 24  hours for a response."], "train_365": ["Customer complains that he lost hos i pad in british airways.", "Agent is suggesting customer contact  with help of URL  link to get back stolen property."], "train_366": ["The customer is asking that how to create a new user for ftp access to his virtual machine.", "The agent updated that one of their engineers will reach out as soon as possible and if the issue is urgent they recommend filing a support case over here."], "train_367": ["Customer is complaining that they are unable to play songs from their home screen or control center.", "Agent updates to try logging out, restarting their device and logging back in which helped the customer to resolve the issue."], "train_368": ["Customer is complaining that download and install a game on Xbox one even after reinstalling. Also states that he is getting an error message that he has tried multiple times.", "Agent requests to try by resetting the router/modem, power cycle and the gaming console."], "train_369": ["The customer was questioning that why he was charged for watching the latest episodes.", "The agent asked the customer to download the network app and watch it for free."], "train_370": ["Customer asking that she cant find bisto gravy powder  in any local stores.", "Agent requesting to send her postcode and he will check local stores for the product."], "train_371": ["Customer is complaining about experiencing dropped calls for the last month.", "Agent requests for additional information over DM to assist further."], "train_372": ["Customer complaining about delay of his flight as he has an emergency to go for his rehearsal.", "Agent has posted an update of departure of flight and requested customer to sign up for the further notification."], "train_373": ["Customer complaints that he ordered 75 days ago and  missed deadline for claim as its more than 90 days.", "Agents informs that the form will allow them to move forward with the research on this order and get in touch directly."], "train_374": ["Customer is enquiring about the timings of the train.", "Agent replied that 18.03 from Bristol Parkway will arrive to Swindon at 18.28."], "train_375": ["The customer says that he had booked the tickets for the wrong time and ask for a help.", "The agent responded the customer saying that he would be charged extra."], "train_376": ["Customer is disappointed with network issue.", "Agent request customer to DM with his O2 mobile number."], "train_377": ["The customer is complaining that he was charged more than once.", "The agent asking the customer to dm his record locator and will share with the leaders for internal review."], "train_378": ["Customer is asking how to get a 4G LTE SIM.", "Agent informed to visit Gloworld shop with the present SIM, N100 and a valid ID for SIM replacement."], "train_379": ["Customer is complaining about the airtel care for not refund of his money.", "Agent says that complaint is being investigated."], "train_380": ["Customer is complaining that he had spent the last hour trying to contact after sales to get sort out a problem with an m ticket.", "Agent updated that they can be reach on number or through live chat."], "train_381": ["Customer is complaining about subscribing callertune.", "Agent is replying that deactivate the caller tune by sending DEREG to 7728."], "train_382": ["Customer complaining about American air check the baggage non code share air line from past but now its not.", "Agent updated  that the baggage policy was  made changes recently and bags are only checked to the destination of each ticket."], "train_383": ["The customer is asking why the vending machine not working because of which no one could do any transactions.", "The agent asks which specific branch the customer visited, the address of the branch and says they would share the feedback with their support team."], "train_384": ["Customer complains about the streaming issue with #xfinity and the game.", "Agent states that this is TNT quality issue and said that this issue will be forwarded to correct team."], "train_385": ["Customer is complaining that communication gap between idea and third party apps.", "Agent updated that they like to inform that this offer applicable only from idea app and amp ."], "train_386": ["The customer is asking that is there are any ways to save a playlist.", "The agent responded him that the option was not available in android."], "train_387": ["Customer faceing issue with purchased prepaid card.", "Agent informs customer to call on number back of the card for assistance."], "train_388": ["Customer is complaining that the train has not yet left the first station and late already.", "Agent updated that due to leaving reading late your train was behind a GWR service."], "train_389": ["Customer having an issue with laptop.", "Agent updated that failure ID indicates a hard drive failure So that please contact HPSupport for service options."], "train_390": ["Customer having an issue with finding the store.", "Agent updated that they can log feedback on to their system internally so that the feedback is reviewed and also inform that they can look for the product for customer."], "train_391": ["The customer says he had to wait nearly 2 days for an email reply and still haven't had a refund and asks how long will it take to get reply.", "The agent asks whether the customer received any confirmation code and says after providing customer's information within given link, he may receives response between 24-28 hours."], "train_392": ["Customer esquires about linking Aadhaar with mobile number.", "Agent informs customer that as instructed by the Government of India, it is now mandatory to link mobile number with your Aadhaar."], "train_393": ["Customer is complaining that the broken item is received from the amazon.", "Agent updated the options of refund or for the replacement of the damaged item."], "train_394": ["The customer is asking whether there is any reason why his @VirginAtlantic flight for that afternoon is already delayed of 1hr20min and asks with the delay, until what time the check-in will be open.", "The agent informs that the delay is due to one of their aircraft being unexpectedly taken out of service."], "train_395": ["Customer is disappointed withe service as they wanted to check why the balance has been deducted.", "Agent updates that their request is still in progress and will get the positive resolution soon."], "train_396": ["Customer inquiring about the train pass.", "Agent suggest customer not to buy any tickets as the pass is enough for journey."], "train_397": ["Customer is complaining that he unable to enter the guide menu.", "Agent updated the customer to  DM of network related settings."], "train_398": ["Customer is complaining that the opponent not found FIFA17 on xbox 360.", "Agent suggest him to send a picture of what is appearing on the screen when they are unable to play online."], "train_399": ["The customer is saying that it says website's security has expired when he is in online platform and asks to resolve the issue before the uk office opens the next day morning.", "The agent asks the screenshot of the message and sends some of the links to resolve the issue to the customer."], "train_400": ["Customer is complaining about the terminal of the flight.", "Agent updates that they will have on their way ASAP."], "train_401": ["The customer asks what was the reason for last minute cancellation of the 8:25 SUR to WAT and asks for detailed info about when improvements will be seen at stations other than Windsor.", "The agent informs that on the previous journey, the train encountered a fault causing a delay to the next journey, that is the reason the train ran fast and suggests to keep checking the website for future announcements."], "train_402": ["Customer is complaining that they found PS4 highlighted their $199.99 offer in store when searched in google, when they visited the store, they got to know that the offer was not genuine.", "Agent updates that this offer they had previously for an online deal and they are not responsible for any offers which are not directly from their own page."], "train_403": ["Customer is complaining about the Verizon phone that isn't working.", "Agent enquires about the phone service and requests for DM to access the account."], "train_404": ["The customer says that he can't listen to @18979 anymore and says that he is not getting any error message but nothing happens when he just pressed PLAY.", "The agent asks whether the customer getting any errror messages when tries to listen to The xx, then asks to send over device model/OS and the spotify version and then to DM customer's account username or email address."], "train_405": ["Customer is asking about the rugeley store that why they are not dealing with party food.", "Agent says that to get as much product on to the shop floor and we would view these as an individual food party deal."], "train_406": ["Customer is having an issue with tree limb being held by the internet wires.", "Agent informed the customer that tree limbs are not something they can fix and  only tech options is going out to look at this issue."], "train_407": ["Customer is inquiring about correcting the spelling of his name on the flight ticket.", "Agent is requesting for passport copy in order to proceed with it."], "train_408": ["Customer is complaining about wine is not refrigerate.", "Agent informed the customer that they will need to display all of the Meal Deal Options together and informed the customer to DM with Full name and E-mail."], "train_409": ["The customer is complaining that he can only find rbd song.", "The agent responded that they will be having all of the songs soon."], "train_410": ["Customer is complaining about the worst service where they have not received the product yet though they have crossed the timeline.", "Agent request to DM their name, zip code &amp, item number &amp for further assistance to know the date."], "train_411": ["Customer is requesting to help their line 0726668629 which is doesn't connect data bundles.", "Agent updates that the line has been reset and requests to restart their phone."], "train_412": ["Customer is saying like the song link only  have  been posted while sharing a song on twitter.", "Agent updated the customer to  DM for further assistance."], "train_413": ["Here customer is having quality issue of fat beef mince.", "Agent take the details  and asked the customer to message him and also  says that he will refund his amount."], "train_414": ["Customer complains about the service where they are waiting to have a  activation of 2 SIM cards.", "Agent requested to visit Idea store for duplicate sim."], "train_415": ["Customer is complaining that their achievements have not lock when after finishing a game offline and tried to reconnect in xbox live.", "Agent updates that they will allow the proper teams to be aware of the issue and in meantime they recommended to wait and see if this achievement will unlock on its own."], "train_416": ["Customer is asking how to change the language English to french.", "Agent replying that he can resend the mail in a different language but  he cannot change the language settings on the booking."], "train_417": ["Customer enquirers about idea prepaid to postpaid connection as number is been switched off for 24 hours.", "Agent informs customer that it takes 7 working days to migrate from prepaid to postpaid process."], "train_418": ["Customer asking  agent that  if its there any option for apple pay transaction.", "Agent provides  information regarding fast tract collection."], "train_419": ["Customer is having an internet disconnecting issue.", "Agent asked whether this issue happen all the times or not and asked is the power from the modem  connected to a surge protector or is it plugged directly into the wall ,Finally  informed they will schedule a technician to further investigate this issue."], "train_420": ["Customer is complaining about the poor service.", "Agent request to DM for further assistance."], "train_421": ["Customer is complaining that they are unable to play any songs in the app OP5 and they have already uninstalled and deleted the cache.", "After several try agent requests."], "train_422": ["Customer complains about the train which is been running in slow speed and delay every time.", "Agent apologized for the delay and said that the future journey will be better."], "train_423": ["Customer asking help to reset the pin for his data me2u.", "Agent asking to provide  affected mobile number  and last recharge history."], "train_424": ["Customer is complaining  about the why insn't the weather's widget is not working.", "Agent asks to take screenshots within the similar time frame."], "train_425": ["Customer complies on high internet charges.", "Agent assisted the customer by making some changes in the plan."], "train_426": ["Customer  compiling about lost of his preferred seat.", "Agent informs that access is only for business class ticket, members or select American express card holders."], "train_427": ["The customer is complaining that he can't access games on his 2nd window.", "The agent asked the customer to send a direct message to them for further assistance."], "train_428": ["Customer is requesting to get assisted in getting  their account back which has been hacked.", "Agent updates to keep them updated with the outcome since the customer said that some global team is trying to help and also requests to let them know if they need further assistance."], "train_429": ["Customer complaints about the refund for purchasing premier pass.", "Agent has sent DM to the customer for further assistance."], "train_430": ["The customer says that he is in the running to win British Airways Venice flights but the app says there is no ticket number and adds that he have never received an email receipt for the booking.", "The agent apologises since the customer is facing difficulty in Checking in and asks to DM the booking ref, email address and telephone number to assist further."], "train_431": ["Customer is complaining about the adobe software in where \"fill and sign\" selects inconsistent decimal font size fix manually and crashes every few minutes.", "Agent suggested to reinstall the adobe reader app and ask to reach out for further assistance."], "train_432": ["Customer is complaining that why does the website show them this when they click on password rest link sent to him 2 minutes ago.", "Agent suggest to send DM their email address so they can ask someone to reset the password for them."], "train_433": ["Here customer is unhappy with the British airways services where they lost luggage at air berlin.", "Here agent note down the complain and take the feedback for better service."], "train_434": ["Customer is complaining about the verticle lines appears.", "Agent asked to reset SMC and NVRAM."], "train_435": ["Customer is complaining about failed delivery of a product and its replacement delivery.", "Agent wants to contact over phone or chat to assist better regarding the issue."], "train_436": ["Customer is complaining about the app with no updates about travel.", "Agent updated that they are working on the source transport to VCE and they will advise once it has been  confirmed and also updated that there are in touch with airport manager to resolve the issue."], "train_437": ["Customer is complaining about the shuffling of tracks in the Spotify app.", "Agent states that they have made some improvements to their shuffling algorithm."], "train_438": ["Customer is complaining about the NRC app for having a technical glitch.", "Agent is requesting for more details regarding the issue and NikePlus email address."], "train_439": ["Customer is complaining that the employees at the store are not helping customers.", "Agent requests for the store information and to submit a feedback."], "train_440": ["Customer inquires about trains availability.", "Agent provide an URL for next service available."], "train_441": ["Customer is saying that why in free for all different. Customer says he have a 3 to 5 spm even if it gets 3000+ in 5 mins.", "Agent asked the customer about the platform of game and gametag."], "train_442": ["Customer having an issue with his laptop.", "Agent asked the system service tag,registered owner name and an email for assist and informed to run the system diagnostics to isolate any hardware issue in the system and also inform to DM for the same."], "train_443": ["The customer asks what's the points failure impacting trains around FIT and asks whether it is fixed now.", "The agent asks what journey the customer was making and informs that infrastructure faults would contribute to season ticket compensation and adds that normal working has resumed now."], "train_444": ["Customer wants his issue to be resolved and complains about the assistants for not resolving it.", "Agent states that they would offer to help resolve the issue."], "train_445": ["Customer is complaining about the purchased single duvet by mistake.", "Agent states that the left over products to different charities."], "train_446": ["Customer is complaining about a button which is not functioning in his gaming controller.", "Agent is requesting to try out using a new battery or usb cable."], "train_447": ["Customer is complaining that they need to reconnectt to shazam everytime because they don't appear in the spotify shazam playlist.", "Agent updated that try logging out from both apps restarting his phone and logging back in."], "train_448": ["Customer is complaining that they waited over 40 mins for their bag on Saturday in Atlanta when they returned from Cabo San Lucas.", "Agent updates that it must be reported no later than three days to be investicated."], "train_449": ["Customer is complaining that his phone is getting freeze and ding weird things.", "Agent updated that to DM with the country that they are located in to continue."], "train_450": ["Customer is complaining about delayed of flight.So he missing another flight.", "Agent updated that staff at the desk are doing their best to get all passengers rebooked as quickly as possible."], "train_451": ["Customer complained on sainburys lorry driver for making a huge sound near his house.", "Agent ask the customer to DM of registration number and postal code of the area."], "train_452": ["Customer asking about  version cdn endpoints cache files differently in different location and he gets hits in EU  and misses on AU edges.", "Agents updating that he found some documentation that might help with this url."], "train_453": ["Customer asking email address to complain about product.", "Agent suggests that using the URL link he can learn about filling report and violation."], "train_454": ["Customer is complaining about not getting the refund for cancelled ticket.", "Agent is requesting for the booking reference, email address and contact number."], "train_455": ["The customer says that he Signed in as a subscription owner and can't see his subscription and he asks to raise the ticket to get the issue resolved.", "The agent recommends filling a free subscription management support case in the link provided and asks whether he gets any error messages and then asks to send the screenshot of the error message and follow the provided link for further assistance."], "train_456": ["Customer is complaining about the failed delivery of a product.", "Agent requests to reach out via phone chat to take another look."], "train_457": ["Customer inquires about iDeal student offer.", "Agent informs customer that his feedback is being noted."], "train_458": ["Customer is complaining about the live tv which is not working even after trying all the reset stuff where all non live is working fine.", "Agent apologizes for the inconvenience and updates that their phone team will be able to provide more insight and they will be sharing the feedback to them."], "train_459": ["Customer is complaining  that spotify keeps giving me an error that songs aren't available over & amp over again.", "Agent updated that to send DM his accounts username or email address ."], "train_460": ["The customer suggests to sort out new traffic lights on Morrisons roundabout, says that the cars are queued all the way because the lights at Morrisons don't work in sync with roundabout.", "The agent asks which store the problem was at so that he can report it to the Store Manager and adds that they have passed the comments onto see what they can do."], "train_461": ["The customer is complaining that the internet is almost at 0 speed.", "The agent asked to dm with full name and account associated phone number."], "train_462": ["Customer is complaining  about staff and services of the company.", "Agent updated the customer to  DM for for further assiatance."], "train_463": ["Customer is requesting to amend the name with the flight tickets of his 6 family members.", "Agent states the issue has been escalated to the respective team and will amend the name accordingly."], "train_464": ["Customer is complaining about the removal of certain channels even after paying the fee for them.", "Agent states that their billing office is currently closed and requests to reach back in the next morning."], "train_465": ["Customer is complaining that even after reporting and blocking, the spam is increasing in their outlook inbox.", "Agent provides an URL where they can check for an alternative way to manage their email spams."], "train_466": ["Customer is complaining about not being able to open the supply drop in a game.", "Agent is requesting for a video of the issue and suggests to unplug the router and console for 10 minutes."], "train_467": ["Customer complaints of losing seatS.", "Agents inform customer to share his receipt number for the purchase."], "train_468": ["The customer complains that it was a very short sale, he got a notification that he had a tech sale, the drone was included at $349, but by the next morning it's $499 and he could not purchase it since he left his wallet at office the previous day.", "The agent apologises since their prices are subject to change, as stated in their terms and conditions and requests to provide the catalogue number for the drone, so he can advise better and suggests that in future days the product can be reserved for the next days."], "train_469": ["Customer is saying that everytime  a song played, it get uninstall and they are  forced to reinstall it.", "Agent asks to answer in DM where they will  pick up the conversation."], "train_470": ["Customer wants to know if they take an earlier flight, do they need to pay and they tells that they are the Skypriority customer.", "Agent updates to go to airport since the confirmation number is not finding delta reservation and if its a aeromexico ticket then the airport counter will have to process the charge."], "train_471": ["Customer complaining that he  is unable to play the music  in spotfy music app.", "Agent ask the customer to open that app in  incognito mode and it  BTW  it resolved itself."], "train_472": ["Customer is enquiring about entering name while booking a flight and about the additional charges for changing the flight.", "Agent states that the flight change fee along with fare difference will be charged and suggests to make changes up to 48 hour prior to scheduled departure."], "train_473": ["Customer is complaining about early closing of stores and turning away the customers.", "Agent states it is due to the time required to clean the store and the comments will be passed to the store management."], "train_474": ["Customer is complaining for not being able to book tickets from his phone.", "Agent suggests to try out by clearing cache/cookies from the device."], "train_475": ["The customer is complaining that the train was delay.", "The agent updated that if they were delayed about 30 mins or more they can claim for delay repay."], "train_476": ["Customer is seeking in help has he has left the scarf in luggage coach b due to delay of train he is requesting to get him that scarf back.", "Agent states that if he wait at Glasgow, the train manager will get that scarf for him."], "train_477": ["Customer is facing problem with his router connection going offline or down.", "Agents informs customer about pulling up the schedule."], "train_478": ["Customer having an issue with sorting and filtering the albums.", "Agent sent the URL which is having the information of sorting and filtering."], "train_479": ["Customer complains that he is unable to play the games which he bought on ps3 which says that licensing needs update and ps store is undergoing maintenance.", "Agent provided some details to be followed and ask to check DM for further instructions."], "train_480": ["Customer is complaining about the ad pop ups and freezing which makes them to restart the show and ad plays right the next time which 9 times out of 10 it freezes again.", "Agent updates that when they are dealing with the known issue they can always own up to, but what they have described does not fall into the category and asks that have they tried any troubleshooting."], "train_481": ["The customer is seeking  help to resolve his issues.", "The agent says they have responded to his DM."], "train_482": ["The customer is complaining that they have an reception issue.", "The agent asking the customer to message them in the direct so that they can assist better."], "train_483": ["Customer having an issue with Apple watch.", "Agent asked the customer about the model of the apple watch and sent the URL to solve this issue.Finally issue got resolved."], "train_484": ["The customer says that the latest Microsoft update is taking too long, like it's updated only 57% since 4 hours.", "The agent asks which version of Windows the customer is using and shares a link to help resolving the issue."], "train_485": ["Customer is enquiring about the Christmas cake it.", "Agent updated the customer that they have free from Vanilla cake kit and free chocolate Christmas pudding kits available."], "train_486": ["The customer is complaining that their moto z2 was not at all good and not functioning.", "The agent responded and told repair reps to take a look at it."], "train_487": ["Customer is having an issue with phone has it is freezing for 10 seconds when switching to and from  the emoji keyboard.", "Agent asked is having this issue with message app or any third party app and informed to provide current location in a DM. So that they can look into it."], "train_488": ["Customer complains that he is unable to play a music in Spotify music app.", "Agent updated the customer to  DM  for account information to  further assistance."], "train_489": ["Customer is asking when the full train prices will be released since it didn't seem to be out for the whole Christmas period.", "Agent updates that the tickets for 27th will be released tomorrow and 28th will be released on 20/10."], "train_490": ["Customer has problem with his screen panel which has started flickering up and down.", "Agent suggest to contact their answer desk for further assistance."], "train_491": ["Customer is complaining that all the sites are down on their grid.", "Agent suggests to go through and remove/replace the listed files, once cleaned they can rescan the sever and enable the sites."], "train_492": ["Customer is asking to check the speed test for which he pay 100.", "Agent says that nothing can do unless have their router."], "train_493": ["Here customer complain about internet issue where 1 gb of data is gone within 20 minutes.", "Here Agents sends a link where customer can find how to manage  data and also tells him  to message if it wont get resolve so that thier team can help her over it."], "train_494": ["The customer says that the cherry tomato's in the store he visited were mouldy.", "The agent asks the store's information and says that the remaining stocks will be checked."], "train_495": ["Customer is having an issue with channel unavailability on Tv.", "Agent informed the customer to do some basic trouble shooting then ask them to send DM for continue the same."], "train_496": ["The customer is complaining that music won't load when connected to work wifi.", "The agent asked to restart and send username and account email address."], "train_497": ["Customer is enquiring about the timings of the next train and also asking about bus service.", "Agent replied that they need to claim delay repay by visiting train operators website."], "train_498": ["Customer asks for the help to have a convenience as their aged parents are travelling from flight.", "Agent replied that they can assist them at the airport and states that they don't have anyone who can carry their bags."], "train_499": ["Customer is asking help that let them know if they expect the lol surprise 725/4811 to be back in stock.", "Agent updated that they both are currently out of stock due to high demand."], "train_500": ["Customer is complaining that Epson dot matrix printer stopped working on his windows 10 Pc's for no reason need this for work any fixes.", "Agent updated that Microsoft will provide an update as soon as the issue is resolved."], "train_501": ["Customer complaining about cancellation on hotel booking.", "Agent informs customer to call at 1-800- IFLYSWA to help with rebooking or for requesting a refund."], "train_502": ["Customer is complaining that is not letting them to upgrade to Sapphire Reserve because they only had the preferred card for 11 months.", "Agent updates that once the account is at least 12 months old, they would love to assist them with changing their card."], "train_503": ["Customer is complaining about the delay in flight and tells that if flight doesn't make it on time then it will be a problem.", "Agent updates that their Finnair friends will have wheel ups as quick as they can do and updates to check directly with Finnair."], "train_504": ["The customer is asking for the refund that was deducted on his line 0716967895.", "The agent apologizes and told them that they are working on the issue to fix it soon."], "train_505": ["Customer complaining about his network connection  and getting  error code and some of his games are locked.", "Agent suggest to power cycle his network devices and  suggests to deactivate his consoles remotely and try using URL."], "train_506": ["Customer is complaining about the inconvenience like no travelling on time and no proper wifi and ask for the refund of ticket money.", "Agent provided the URL and BEAM app where customer can watch movies and resolved the issue."], "train_507": ["Customer is complaining about the product that he as purchased which makes his baby sick.", "Agent updated to send the picture of the barcode  and also DM full address,telephone number for further investigation."], "train_508": ["Customer is complaining about the 2 items he ordered in which one is undelivered and the other is out of stock.", "Agent states that the information customer received was due to system error and requests to collect them immediately from the store."], "train_509": ["Customer is complaining about the battery of Dyson fluffy cordless which was bought 2 weeks ago and lasts for only 10 mins rather than 20 mins which was stated and asks whether it can be replaced.", "Agent updates that Dyson do prefer to deal with their own after - sales care, so it might be quicker and easier process for them on phone."], "train_510": ["Customer is asking when migrated from prepaid to postpaid, it has not started due to address verification error.", "Agent requests to wait for sometime and they will get in touch."], "train_511": ["Customer is complaining that their internet went out and now it says its limited on router which has an orange light and asks how can they get help to fix this issue.", "Agent updates several solutions which didn't make any change and requested to follow and DM so that they can have a closer look into this issue."], "train_512": ["Customer is requesting to check the order whether its in stock or not and requests to make sure the item is on the order whey they collect.", "Agent apologies for the inconvenience also updates that they have sent the chats through to on of their managers who can look at this issue."], "train_513": ["Customer is complaining about delayed and rescheduled delivery.", "Agent states the issue has been escalated to their transportation team."], "train_514": ["The customer says that the train delayed by 7 minutes and he missed out another one because of the delay and missed family dinner.", "The agent informs that a broken down cross country train in Bristol Parkway area has caused delays and cancellations."], "train_515": ["Customer complaining that his lr classic sync to cloud is stuck at 159 images and 16 pending.", "Agent suggest that they are looping in an expert they can help him over their and telling that to check the link and let he know how many images do he see synced using URL."], "train_516": ["The customer is having problem in starting up some games and says its resolved after unplugging the remote.", "The agent is asking for error code or message and asks the customer to rebuild the database by providing procedural steps."], "train_517": ["Customer is very delightful with the service when they heard heart warming story from the passengers how the airline helped after breaking her foot.", "Agent was really appreciated with the feedback and asks the customer to DM rapid rewards, if not then provides an URL where they can enroll the rapid rewards."], "train_518": ["Customer complains about  issue on update of i phone.", "Agent updated the customer to  DM for further assisatane."], "train_519": ["Customer is asking how to disable the text analytics API or to regenerate the keys.", "Agents updates to DM with their Sub ID to take a closer look."], "train_520": ["Customer is complaining about music randomly stops playing.", "Agent updated that if the pair of headphones could use to test with and if the same issue occur then DM us your answer."], "train_521": ["Customer wants the refund for the unused ticket.", "Agent states that the tickets were not tracked and cannot refund it."], "train_522": ["Customer is requesting to add support for other U2F cable browsers like  Opera and Firefox via plugin since they have to use codes in a right pain.", "Agent updates that this has been sent to developers team and requests to DM details to have a further look into this issue."], "train_523": ["The customer is complaining that hot curl brush was melted and bend.", "The agent confronted saying that he will get refunded and ask him to dm the name of the colleague that he spoke with."], "train_524": ["Customer has complaint about bad service  in  flight he is travelling.", "Agent informs customer to DM his record locator to have a look."], "train_525": ["Customer is complaining about not resolving the issue- D3NB5VD.", "Agent updated that they will look into it and resolve ASAP. Finally the issue got resolved."], "train_526": ["Customer is unable to restart the router.", "Agent updated to check the back of the router use the pointed end of a paper clip and hold the Reset button for 10 seconds."], "train_527": ["Customer complaining about not off to a great start.", "Agent is replying that he would like to look into this for him."], "train_528": ["Customer is disappointed with the greens bought to have with their dinner which they had to throw all out.", "Agent apologies for the inconvenience and asks whether that they would like to refund via mail or post."], "train_529": ["Customer is asking about can he get a credit transferred to an  active card.", "Agent is telling  that they can request   and asking to access to your  account online."], "train_530": ["The customer is complaining that he was facing issues even after several updates.", "The agent asked have they tried to install the update manually."], "train_531": ["Customer is complaining about awful treatment by a flight attendant.", "Agent replying that his team to expect exemplary service at all times  and ask to send  his comments to improve their service."], "train_532": ["Customer is questioning that does the new updates have macOS High sierra support.", "Agent updates that they are looping in an expert and updates that it does support macOS High Sierra and requests to refer the system requirements in the given URL."], "train_533": ["Customer unable to add the music play list or library using Apple Music.", "Agent asked the customer is there any error message while adding and informed the customer to DM for continuation."], "train_534": ["Customer is complaining about getting the error like The client identifier provided is invalid.", "Agent apologies for the trouble and updates that they are not affiliated with discovery sounds."], "train_535": ["Customer is asking to check the inbox where they have sent a messages few days ago to sort it out the issue.", "Agent states that without valid ticket they will not allow to travel.."], "train_536": ["Customer is complaining about not able to utilize the trail period of creative suite.", "Agent updated that trial app can be used once for 7 days on 1 computer and  email id and also send the URL of the plan for purchase."], "train_537": ["Customer having an issue with the channels.", "Agent updated that to disconnect both power and coax cables from the box and wall jack and also inform that they all ways ready to do 24/7  service."], "train_538": ["Customer is complaining that the he was charged for months after the cancellation of account and he was refused to return the money.", "Agent asked to DM to assist ans said that T-Force is always there to help them out."], "train_539": ["Customer wants to change their seat from 17c to 1c.", "Agent updates that their seat has been set as per requested and they can make payment at the service counter on departure day."], "train_540": ["Customer is complaining about the end of waiting in the line twice people can't even give consistent information.", "Agent asks to have exact steps and asks to DM."], "train_541": ["Customer enquirers about delay in repay  compensation.", "Agent informed customer to contact through email for further information."], "train_542": ["Customer enquirers about seating in flight.", "Agent informs customer that only middle seat is avialble."], "train_543": ["Customer complaining that unable to play the selected program.", "Agent is replying that reboot the cable box and try to access the recording again."], "train_544": ["Here customer faces some internet issue while plugging to router.", "Here agent note down the issues and gives the better assistance."], "train_545": ["Customer is asking about the 3 green dots on the screen and show on parts that are black.", "Agent suggested that to check on the link to check the closest store in australia ."], "train_546": ["Customer is enquiring the agent regarding that is it possible to fly standby on the 3:15pm from SEA to PHX.", "Agent is updated yes standby listing forthe 3:15pm is available for $75."], "train_547": ["Customer is complaining that there is no staff on automated machine unable to issue group save tickets.", "Agent updates if they can't purchase the ticket at the station you can purchase on board from a conductor."], "train_548": ["The customer says he is facing problem that according to app and website he has paid nothing for upgrate but in actually he has paid.", "The agent asks to drop DM to resolve the issue."], "train_549": ["The customer is facing an issue with spotify and says its resolved after restarting the device.", "The agent asks for device, OS and spotify vesion info and asks to restart the device."], "train_550": ["Customer is complaining that his friends pc and had won 7 free upgrade to win 10 but as died they need to reinstall but no CD key help.", "Agent updated that to help his friend to resolve issue the address and suggest that to see the link."], "train_551": ["Customer is complaining that their xbox is not turning on and power supply blinks orange and white.", "Agent recommends never to use power strip or surge protector with the console, and also shares a link which will help the customer to give more information once their console is registered."], "train_552": ["Customer is complaining about the iPhone 7 plus which get freezes and glitchy since an update to IOS 11 and tell that IOS 11.0.2 is not good enough.", "Agent updates to meet in DM through given link and they will continue to look over the issue."], "train_553": ["The customer says he is stuck at BWI and did not get the flight along with 10 other members.", "The agent says the flight left at scheduled time and arrived and asks to DM customer's record locator and to explain what had happened."], "train_554": ["Customer is complaining that they have reported a buyer as they were neglecting the return procedure by stating incorrect information and being rude.", "Agent requests to DM their full name, item num, postal code and mail address but when no response the agent tells to have a resolution between them and the customer."], "train_555": ["Customer is complaining about the advertising offers which indeed are not available.", "Agent updated that they have fed this back to the department for future consideration."], "train_556": ["Customer is enquiring about route change for his fllight,.", "Agent informs that its not possible, as it is not a fly thru or connecting flight."], "train_557": ["Customer is complaining why is the on demand channels are not updating programs.", "Agent requests to follow and DM the account information including the full address and phone number."], "train_558": ["Customer is complaining that the embedded URL does not activate the offer.", "Agent updates to call to their digital assist team to look into this at the given contact number."], "train_559": ["The customer is complaining that they are getting more and more new errors everyday and laptop crashes all the time.", "The agent updated that might cause of an antivirus software that triggers that error and asked to disable the program and confirm that this resolves the error."], "train_560": ["Customer is complaining that they bought data at 999 instead of 99 and advise if what is over and above is refundable.", "Agent updated that balance is 3072 MBS then alert them they will reverse."], "train_561": ["The customer says he had left his scarf on a rail replacement and asks how can he contact the coach company.", "The agent says that the customer needs to log  on to lost property site and they will contact him back if they found the one."], "train_562": ["Customer is complaining about the software which is automatically updates and then all the settings, changes they made  are been lost.", "Agent updates to first try to check the illustrator and then will loop with the expert and also requests to check it once with a regular mouse and track pad just to issolate the issue."], "train_563": ["Customer is seeking a help to re install the application and complaining that screen appears like blue.", "Agent updated an URL to the customer to resolve the issue of blue screen error."], "train_564": ["Customer is complaining about the service in the cafe where they treated normally.", "Agent replied that this issue will be forwarded to the management team."], "train_565": ["Customer is complaining about VirginTrains timings.", "Agent updated the timings."], "train_566": ["Customer is in seek of help as he is not able reach his host family since two weeks has been passed.", "Agent states that the specialist will deal this issue and will reach out asap."], "train_567": ["Customer is complaining  about operating system while playing game .", "Agent explaining regarding process of Tracert programming ."], "train_568": ["Customer is asking to match online price with receiving price by creating  online stores where it can be matched.", "Agent apologised for the disappointment and asked the customer to give full name, address and email address."], "train_569": ["Customer is complaining that they were denied from having extra leg room seats without any explanation.", "Agent states that there are lots of different reasons for changing the seats in a cabin and assures that the costs would be refunded."], "train_570": ["Customer enquirers about cancelling an order.", "Agent informs customer to let them know if they have trouble in cancelling order."], "train_571": ["Customer is complaining that they got a message saying that they are valued customer with an offer but the offer was bogus.", "Agent apologies for the for not providing that offer and also  updates that their sales team will be able to give them the most up to date discounts and packages available at the present time."], "train_572": ["Customer is complaining that they dropped it 6 last night and had a tempered glass screen protector on it of $40 but still got cracked the screen about an inch.", "Agent assisted them to file a claim and get a replacement device sent out to them and requests to let them know if they face any problem with their replacement device."], "train_573": ["Customer is complaining about the snacks which aren't gluten free but placed on the free from shelf which very misleading and potentially dangerous.", "Agent updates that they have alerted the store and they are moving them right now."], "train_574": ["Customer is enquiring about the not to discontinue the guinea pig muesli.", "Agent updated the customer to DM with the photo of the product and inform that the same stock not there and suggest to mix the Tesco Guinea Pig nuggets with some thing else."], "train_575": ["The customer says that the internet service is down all days in his residential area.", "The agent asks the customer to press and hold the alarm silence or reset button for 15 seconds by which the issue was resolved."], "train_576": ["Customer ask the agent of explanationt on train dealy.", "Agent explained the customer about passenger pulled emergency alarm."], "train_577": ["The customer is complaining that internet was not at all working in their area from past 1hour.", "The agent asked to battery back u[p and unplug i from the power cord for 2 mins and asked to dm them."], "train_578": ["Customer having an issue with paying bill.", "Agent updated the customer to sent DM with full address for assistance.Finally issued got resolved."], "train_579": ["Customer is complaining about the delay.", "Agent updated that Network rail working to fix but no ETA."], "train_580": ["Customer is complaining that they are receiving frequent calls from customer care support.", "Agent requests to share contact number, complete address of store and states that this issue will be forwarded to higher authority for further investigation."], "train_581": ["Customer is complaining why its taking more time to reset a password since they have waited for 30 hrs and still no response.", "Agent updates for ios 11.0.3 follow steps, go to setting, their name, password, Security. If it doesn't help then DM them so that they can continue with them in provided URL."], "train_582": ["Customer is complaining about the cancellation without lettering him.", "Agent says that he called the store and advise that order was cancelled automatically by the warehouse in regards to a stock issue."], "train_583": ["Customer enquiring about the checking of stock levels on website.", "Agent helped the customer to find his product with correct size availability ."], "train_584": ["Customer is complaining about the uncleanliness in the train.", "Agent updated that they will pass this information to the fleet team."], "train_585": ["Customer is complaining about the grapes that bought on Saturday from Lincoln store.", "Agent asks for their full name, address, a clear photo of the product barcode and the supplier code so that they can log this from their end."], "train_586": ["Customer is complaining about no entertainment during a  4 hour flight.", "Agent updated to contact FA and crew members for any assistance."], "train_587": ["Customer complaints about delay in flight.", "Agent request customer to double check and resend the confirmation number for review."], "train_588": ["Customer is complaining that 90% of songs are not playing and notifying like not available in the album.  Customer has also shared the screenshot of error in URL.", "Agent asked to logout and login again the devices. Based on screenshot from the customer, agent updated that it is better to reinstall and have reported the complain to the developers."], "train_589": ["Customer is complaining about failure in uploading the music.", "Agent requests to share some screenshots of the issue and states to upload in mp3 as well as other formats."], "train_590": ["Customer is requesting to resolve some of his issues.", "Agent is requesting for the information on the issue."], "train_591": ["Customer inquires about upgraded internet speed.", "Agent informs customer that modem is set up for and showing to be producing URL."], "train_592": ["Here customer is complaining about down service of iPhone X where he wants to order a new device with exciting offer.", "Here Agent informs the customer that some maintenance is going on  , if he has some issue can message him for the better assistant."], "train_593": ["Customer is asking whether they need to be online to get full library songs.", "Agent replies that this feedback will be passed to the right team."], "train_594": ["Customer wants to book flight between 26th feb to 28th march but the booking is not available.", "Agent updated that they can prefer to book alternative flight and asked to click on URL for contact details."], "train_595": ["Customer complaints about listing being misleaded.", "Agent assures customer that his feedback has been recorded."], "train_596": ["Customer is complaining that they have cancelled a payment to a scammy listing the seller won't communicate and now it said they need to pay now.", "Agent updated him that they have already sent a report the relevant team ."], "train_597": ["Customer is complaining about the dropbox which is popping up everytime they boot about smart sync.", "Agent updates that they can disable the notifications of the dropbox desktop application from the main menu bar, where the notification/recents will appear, by clicking learn more from that area will dismiss it permanently."], "train_598": ["Customer is requesting help to get back their iPhone which they left on the train on 22.35 from Ealing Broadway to Langley 22.57.", "Agent updated that the staff at Oxford checked the train but unfortunately no phone was found and advises to report it as lost on their partner website."], "train_599": ["Customer complaints about cancellation of advance booking without notification.", "Agent informs customer that one of the specialists will followup and assist."], "train_600": ["The customer saying that the plastic in a Bfl is so more pollution and now the company is able to profit on remaining 75% of sales.", "The agent is replying that they are trying to remove all single use carrier bags and offering customers a bag at 10p."], "train_601": ["Customer is complaining how can they issue paper vouchers which is redeemable only by mail.", "Agent updates that for some instances they need to issue paper vouchers and can use the voucher at the given address where the voucher need to bring in person in order to use it."], "train_602": ["Customer complains that he had redeemed a code via Psn  for Fifa points which has not been arrived into his EA Account.", "Agent directs customer to follow on Twitter and get DM with further instructions."], "train_603": ["Customer is complaining about the iPhone which speaker is not working the music thing when you swipe up from the bottom does't work volume/ringer on side doesn't work.", "Agent asks  the current IOS version and current location in DM."], "train_604": ["Customer is enquiring that is there any chance of some minced pies/mulled wine for 2nd December chingford mount xmas choir service please.", "Agent updated that local store does not have a community champion So please sent DM with postcode so that they can find out the contact details for customer nearest community champion."], "train_605": ["The customer is asking how to manage his bookings.", "The agent updated that booking agent should have given them an airline record locator or pnr."], "train_606": ["The customer is complaining that even after following the given steps it continued to shuts off.", "Agent asked to send the photo of the console where it has attached to the power source."], "train_607": ["Customer is complaining about delaying in the order and finally he wants to cancel it.", "Agent updated that depending on which carrier has this parcel there may be an option to cancel the order through your account."], "train_608": ["The customer is complaining that they were charged 200$ for iphone x6 which is less in the market.", "The agent asked to dm them the claim number and where they have purchased."], "train_609": ["The customer is complaining that noise from the idling trains on the mainline in the bath.", "The agent gave the contact details of network rail."], "train_610": ["Customer telling that he is exited for Christmas.", "Agent asking that will he have usual color theme and asking to give his hand in the kitchen."], "train_611": ["Customer enquires about the cancellation of the tickets due to incomplete payment and asking for compensation.", "Agent states that the booking should be confirmed with successful payment from customer's end."], "train_612": ["Customer is complaining about the unions which cost is 1.65 for 3 onions.", "Agent says to DM full address using below link will be send a gift card out instead."], "train_613": ["Customer is complaining for having different regulations of electronics that can go into hand luggage for Maldives..", "Agent states that they are complying with the UK governments new security requirements for cabin baggage."], "train_614": ["The customer is complaining that they have lost more than 50 contacts and battery also sucks after the update.", "The agent asked to dm them for further review on that issue."], "train_615": ["The customer is complaining that there is a continuous paper jam issue.", "The agent asked to look for obstructions in the input tray,output tray,cartridge access area and underneath the printer."], "train_616": ["Customer enquirers about change his flight booked date.", "Agent informs customer to  make flight change."], "train_617": ["Customer telling that having trouble connecting to cod:IW.", "Agent asking that are you playing on wired or wireless connection  and suggests that try to unplugging both router and consoles for 5 minutes and try again."], "train_618": ["Customer is complaining about price says chicken 4 but a different more expensive  chicken on the self.", "Agent says have spoken to the metro and have sorted this out."], "train_619": ["The customer is complaining that the paypal holding the funds pending and asking for release.", "The agent updated that it will be exactly 21 days, and the funds will be released automatically in their paypal account."], "train_620": ["Customer is complaining about the seat reservation though he had the ticket of reservation he and his fiance unable to sit and travel on the seats.", "Customer apologized for inconvenience and suggested to contact customer resolutions team to claim a compensation."], "train_621": ["Customer is complaining that even after upgrading to plus its saying Upgrade to Plus to enable permission settings.", "Agent updates that existing Plus users will keep the same features including permission settings as long as they are customers and regarding settings they have flag this with their team and hopes it will help."], "train_622": ["Customer is complaining about the food service where there was no food 12.07 from Euston to Liverpool 1st class and also complaints about no contingency.", "Agent updates that they will certainly pass their comments on."], "train_623": ["Customer is facing service issue.", "Agent insist customer to scheduled an appointment to get it resolved."], "train_624": ["Customer is complaining about airline as they charged  them and also checks their bags at the gate.", "Agent makes her understood the basic economy rules of flight and takes feedback."], "train_625": ["Customer complains about the Comast service.", "Agent asks to send DM the account info."], "train_626": ["Customer is complaining why can't they locate their lost baggage.", "Agent updates that their agents are working to locate and reunite them with their belongings."], "train_627": ["Customer is complaining that Ps4 stopped working.", "Agent updated that turn off the console and disconnect all the cables from it for about 3 minutes and also informed that follow them via twitter and send DM for further instructions."], "train_628": ["Customer is complaining about delta  delay on all days.", "Agent updated that all the flights are showing on time."], "train_629": ["Customer is complaining about the apple device which happens regardless of devices being attached.", "Agents asks about the recently occurred updates and tells to take a closer look at this together in DM."], "train_630": ["Customer is facing network issue @Oban.", "Agent informs customer to update real time  as he has been informed that issue has been treated."], "train_631": ["The customer is complaining that tech never plugged in the battery pack.", "The agent updated that the battery is used to keep a dial tone active with a loss of power."], "train_632": ["Customer paid the money to a wrong number and now he wants to reverse the id.", "Agent informed the customer to provide the name,amount transacted,phone and id number via DM."], "train_633": ["Customer complains about pop up notification while using facebook.", "Agent updated the customer to  DM for further assistance."], "train_634": ["Customer is angry about rise in cost of products.", "Agent informs customer that his feedback has been reported."], "train_635": ["Customer enquirers about staff travel  booking.", "Agent informed to contact MyIDTravel for further assistance."], "train_636": ["Customer is asking saying about the less then 100 calories is irrelevant.", "Agent asks to send the  bar code."], "train_637": ["Customer is struggling to find T491204T recommended by Jodie in Tuesday service which is out of stock.", "Agents updates the store in which the stock is present with details and apologies for being left disappointed."], "train_638": ["Customer is complaining to explain why they are asked to test the modem and take away the wifi when they had it before.", "Agent updates to provide them with their account number via DM and can submit feedback on the agents through URL."], "train_639": ["The customer is asking about the 1405 train delay.", "The agent replies that the delay was due to trespassers on the line."], "train_640": ["Customer is asking help to submitted a claim on the 19/09 and was said they will get a response within 20days.", "Agent updated that they have received their case and amp and they will contact them as soon as they can."], "train_641": ["The customer want to change the reservation from PM to AM and says he changed reservation without additional charge with the agent's support.", "The Agent says still the customer can change the reservation online with no charge fee since it was risk free cancellation time."], "train_642": ["Customer is  having issue with Verizon live chat not working in app.", "Agent informs customer that The chat in the My Fios app just goes to them over Facebook messenger."], "train_643": ["The customer is asking why he has to pay the bill since he never got 1gbps down and also he is saying that tool is not showing the proper results and reflects no issues even he is facing real issues.", "Agent replying that if computer directly connected to router it would show  accurate speed in internet."], "train_644": ["Customer is questioning why they have changed the recipe for Bramly apple pie which used to be so good.", "Agent updates that they are looking for their name and nectar card number so that they can arrange a refund for them."], "train_645": ["The customer is complaining that hulu is just chugs at the most random moments.", "The agent asked to reboot the device and modem/router for 1-2 mins."], "train_646": ["Customer is enquiring about when will the new free from cheeses be available in stores.", "Agent asked the customer that which store that she visit generally and updated the customer to DM with postcode So that they will check with all near store that the product the customer wants is available."], "train_647": ["Customer is complaining that paying even more is not fair for that feature.", "Agent updates that they are looking to make Smart Sync available to more users and the pricing will reflect to the professionals as the value they were adding through new features."], "train_648": ["Customer is complaining about DW CC 2018 (windows 10) when they scroll using touchpad, DW crashes.", "Agent replied that the web expert will be back on monday morning and also states that this bug has been resolved long back and they can check when it comes."], "train_649": ["The customer is complaining that they can't download any workout apps even wifi doesn't work either.", "The agent asked to send a screen shot of the error they are facing."], "train_650": ["Customer is complaining about the poor service where they failed to receive the product delivery on time.", "Agent states that this issue will be investigated and appropriate action will be taken against them."], "train_651": ["Here customer is complaining about extra charges on return  flight.", "Here  Agent gives details about new charges fee  from year 2014 and gives the  benefit details  of it."], "train_652": ["Customer is complaining that when they try to open files on PC using Backup Plus Slim for Mac its opening Pictures and some text files instead of their Documents.", "Agent updates that time machine was not designed to restore on PC and recommended to contact Apple to solve this issue."], "train_653": ["Customer complaining about he had updated me iPhone 7 to IOS 11.1 but still calendar doesn't  work.", "Agent asking what device are you using and version of ios  and also telling that that should found in  settings & gt."], "train_654": ["The customer is complaining that he has bought gluten free pitta yesterday and it was gone mouldy today.", "The agent asked to dm full name and address via this link so that to get a gift card."], "train_655": ["Customer complaints that he is being charged unnecessary.", "Agent informs customer that service has been deactivated as requested."], "train_656": ["Customer is complaining that no option on their customer care line to speak with a customer care agent they have been trying  to recharge a card for days now.", "Agent updated that to informed that all recharge issue requires the complete serial number it not clearly visit the nearest shop for assistance."], "train_657": ["As customer is unable to login or sign up to the particular website he loves to use the app.", "Here agent ask for the customer  location and tells him to wait until l new launch  which can be used in his location."], "train_658": ["Customer wants to unsubscribe an account for which customer has sent an email but it is spam and getting a notification like unable to unsubscribe.", "Agent updated that though email has been received they will look into it to understand what the problem is and also updated that the feedback will be taken."], "train_659": ["Customer is requesting to help with issue which they have done everything to try fixing it.", "Agent updates that it will be best if they contact their Answer Desk team for further assistance with the given link."], "train_660": ["Customer says MBP swapped arrangement of monitors three times today.", "Agent asks to DM  and they will continue from there."], "train_661": ["Customer is complaining that Google play is not reading SD card.", "Agent asked to re install the Google play app."], "train_662": ["Customer is complaining about the DVR which is not setting up programs to record.", "Agent updates to reboot and tells that sometimes rebooting takes a while which is normal."], "train_663": ["Customer is complaining that they took corporate connection paid 3 months advance on sat 28 oct but still no response.", "Agent updates to kindly assist with stated issue."], "train_664": ["Customer is complaining about the reroute people to other airports and delayed for 4hrs and they haven't received food so far.", "Agents says they are not able to issue vouchers from here,but feel free to speak to an airport crew member."], "train_665": ["Customer is complaining about an issue at the store and the store manager did nothing on complaining.", "Agent states that they have informed police and staff are working to resolve the matter soon."], "train_666": ["Customer enquiring that when will the dark choc digestives be rolled out in all stores.", "Agent replying that they should be available to buy  now in stores and DM  his postcode and he will check their local stores."], "train_667": ["Customer is asking whether all trains cancelled this morning from London Euston to Manchester Piccadilly and also asks about chiltern trains and cross country trains.", "Agents replies that all trains are cancelled and due to their shorter trains out in service they have already being full capacity."], "train_668": ["Customer is disappointed with the customer service and since they were trying to reach platinum this year.", "Agent apologies for the inconvenience caused and requests to DM their confirmation number for review."], "train_669": ["Customer complains about the boarding groups where he was in 5th group but wanted to have the priority as 1st group.", "Agent asks to reach out them any time for further assistance."], "train_670": ["Customer was very disappointed about variation in the price.", "Agent says to check with the rider app under the help section or email to respond."], "train_671": ["Customer is complaining that how long is the typography fix going to resolve.", "Agent updated the customer that they are looping with experts to resolve the issue and also informed that in the creative cloud application click on the 3dots on top left corner and choose check for updates then update should appear."], "train_672": ["Customer is complaining about his iPhone which gets hanged while doing conference calls and messages and also gets slow.", "Agent suggested to update iPhone to iOS 11.1 and to DM for further assistance."], "train_673": ["The customer his live TV stream is working everywhere but when he tries watching it with Blazers basketball it says \"connection error\".", "The agent asks to send the ZIP code and sends a link to resolve the issue."], "train_674": ["Customer is enquiring about the fee on relisted/unpaid bids.", "Agent updated customer about the fee-listing promo."], "train_675": ["The customer says that he is not happy with the sandwich he received since there was only a small amount of chicken in it.", "The agent asks to DM the customer's name, address and product details and from where did he bought the sandwich from and refunds $2 since the customer was not happy with what he received."], "train_676": ["Customer asking that how to set his macbook pro's resolution  to 1280*720 without attaching a 2nd monitor and also set the resolution and record his screen.", "Agent replying that  try setting by using this url and also  to set the resolution   for primary display choose apply menu & get system  preferences and then click display."], "train_677": ["Customer is complaining about catering service in British airway.", "Agents updated the customer that he will share the feedback with related team."], "train_678": ["Customer is complaining about the Nike app which showed them 15 mins workout but showed the start stop time that's 30 mins.", "Agent recommended editing their run to match the duration, go ahead and logout and then log in and go on a test run and report back."], "train_679": ["Customer is asking that can they preorder their iPhone X through them or apple.", "Agent updates that they can preorder through T-Mobile and can come back to this chat."], "train_680": ["Customer is enquiring about when longer trains are coming to Efield.", "Agent informs that list has not yet been provided yet."], "train_681": ["Customer complains Chromecast which is not working in the app.", "Agent provided the link where the steps are available to reinstall the app."], "train_682": ["Customer is complaining about that there are still trains where the journey takes nearly hours yet their are no toilets on trains.", "Agent says distance trains have toilets only some urban trains do not have any toilets facilities."], "train_683": ["Customer is unable to get or play the video in amazon prime video.", "Agent are circulated this issue  to internal concerned team n resolved it."], "train_684": ["Customer is complaining about delaying of the flight.", "Agent is updated that they will put on priority standby status and they will work to re accommodate ASAP."], "train_685": ["Customer is complaining that her iphone is not connecting to wifi where as other devices and smart tv is working fine with the same network.", "Agent asks her to reboot the settings and also asks details about network and ask the customer to message so that with further chat he can  resolve the issue."], "train_686": ["Customer complaining that spotify cares application wont play.", "Agent is suggests to logging out and restart  his device and and asking about his device and  and operating system and also asking his to dm his account user name."], "train_687": ["The customer asks where would he send a charity request to and says he wishes to get tesco onboard for their charity event.", "The agent says the customer will be able to get in touch with them via store locator and community champion of the store will get back in touch with them once the information is sent by the customer."], "train_688": ["Customer is having an issue with not working of Bluetooth on his iPhone 8.", "Agent updated that send the URL to customer related to Bluetooth issue and also informed to send DM."], "train_689": ["The customer enquires why the product he ordered has not yet been shipped.", "The agent asks whether the customer received any email advising delay and informs that some orders are taking little longer than usual Following Black Friday and Cyber Monday and asks to inform them if it isn't delivered at the designated time."], "train_690": ["Customer is having a freezing issue in his device.", "Agent updated to perform the clean boot to improve the system performance and also informed to contact AnswerDesk Team."], "train_691": ["Customer is unable to use iCloud backup on his iphone X.", "Agent informs to look  further into DM."], "train_692": ["Customer has problem with his iphone i tunes library created.", "Agent informs customer to DM if issue comes back."], "train_693": ["Customer is complaining about the experience in the flight ever like broken seats, no entertainment for 8 hours, rude staff etc.", "Agent suggest him to DM his booking ref, full name, email address and flight details and they will be able to look in to this."], "train_694": ["Customer asking about fisrt class service in coach and also asking  sandwich from the shop.", "Agent replying that it depends on the availability in the shop and it is up to the staff on board."], "train_695": ["Customer complaining about hulu support live tv always buffering.", "Agent suggests to reboot of his Roku modem along using URL and suggests to contact his viewer experience team by phone or live chat."], "train_696": ["The customer is complaining that the idea 4g network was not at all good and they about to post a video regarding that.", "The agent asked to dm their idea number and along with the alternate number for further assistance."], "train_697": ["The customer wants to buy music but he is unable to do and he says that if he search up a song, click 'buy', type in password and then it makes him do it several times.", "The agent asks whether that happens only in the iTunes Store app, whether the customer is able to sign into their Apple ID website without any issues and asks to DM the result after trying to restart the device."], "train_698": ["Customer is complaining that the Xbox is showing black screen where green animated thing also buffers due to loading isssue and shows only % and buffering.", "Agent asked to unplug the router and plug again and asked to send a photo of error in the URL."], "train_699": ["Customer is asking whether he can collect a tix from for a train from war cent to new york.", "Agent updated that service is not available foe york and asked to collect ticket from ticket machine."], "train_700": ["Customer is  asking that why they have stop selling/stocking sainsbury's vindaloo curry without rice.", "Agent says to follow the link so that its possible to pop in a request for it to b stocked in your preferred stores."], "train_701": ["The customer is asking why the delivery of the product is delayed even after receiving dispatch confirmation email and asks what would happen if he refuses to take the product.", "The agent responds, the delay is rare due to various factors and the driver would return the parcel back to amazon if customer refuses to take it and full refund will be done."], "train_702": ["Customer is complaining that he didn't manage to connect his domain name and his server hosted by azure.", "Agent updated that they will take a look at this resource which may help."], "train_703": ["Customer is seeking help for check in since there is a delay.", "Agent apologised for the crews delay and informed to assist and send a head ups to airport team."], "train_704": ["Customer enquires that when they are going to take fee, in times of sales or invoice at a later date.", "Agent states that they will charge with an invoice and also states that since the sales canceled or unpaid it will take time to resolve the situations."], "train_705": ["Customer is having an issue with App Store app.", "Agent informed the customer to delete the app and redownload it from App store."], "train_706": ["Customer complains that two employees have changed the apple id pw's to have the access of personal information on returned iPhone.", "Agent ask to DM for further assistance and the local team will investigate about this."], "train_707": ["Customer is asking that he had paid for a season of rake downloaded it to his ipad and amp now they can't watch it.", "Agent suggest him that if possible to download purchased content for offline viewing and DM us."], "train_708": ["Customer is complaining about   no refreshments for 75 minutes sat on train.", "Agents telling that sometimes a host will park at a convenient location  and he will make an announcement."], "train_709": ["Customer is demanding the refund of delivery cost for the delayed delivery of a TV he bought.", "Agent requests to check the status of delivery and the information about refund by providing a link."], "train_710": ["The customer is facing the problem that he is unable to stream more than few seconds and says that the tech support seems not working on Sunday.", "The agent asks which device the customer was using and then asks to try unplugging for a few min and then to restart and suggests to Phone/chat support."], "train_711": ["The customer is complaining that he id getting page does not exist issue.", "The agent asked them to bear with them as they will investigate about it deeper."], "train_712": ["Customer is having some display issue.", "Agent asked which apple watch is using,version and asked display issue with any other apps and informed to start updating both devices to see if the issues continues."], "train_713": ["Customer is complaining about the cancellation of a specific train.", "Agent states that they would provide compensation upon renewal."], "train_714": ["Here customer is complaining about the channels not available on TV .where internet is working properly and also he tried rebooting  still faces the same issue.", "Here agents ask the details and ask the agent to reboot the TV assist the customer."], "train_715": ["Customer is complaining about the deductions charges made for no reason.", "Agent updated the customer to provide the phone number and informed the customer that their team is working on it."], "train_716": ["Customer is complaining about the loading issue in the game at XBOX 360 loading screen.", "Agent suggested to uninstall and reinstall the game."], "train_717": ["Here customer is unable to book a flight and taking help.", "Agent note down the details and tries to help him out to give him proper solution."], "train_718": ["The customer asks why there is cauliflower cheese with turkey Christmas dinner instead of carrots/parsnips/peas.", "The agent asks which store did the customer visited and says that they are unable to swap any products in the cafe as they are trying to cut down on food waste and adds that they have fed that back with the cafe manager for internal review."], "train_719": ["Customer is enquiring about train timings and weight limit on his luggage.", "Agents informs that there is no weight limit on his lugguge unless its been  carried by himself."], "train_720": ["Customer is saying that while exporting PDFs results in duplicate pages.", "Agent asked the customer to check CC desktop app."], "train_721": ["The customer is complaining that his network was deactivated.", "The agent asked to visit the nearest idea store for further assistance."], "train_722": ["Customer is complaining about false debits from his credit card.", "Agent requests for the name, phone number and address for further assistance."], "train_723": ["Here customer tried to fill claim and unable to do so because of service provided by the company.", "Here agent note down the details and assist the agent to follow steps provided and tries to discuss the policy provided by the company."], "train_724": ["The customer was asking that why he has been charged for bags.", "The agent responded saying thatbasic economy fare checked bgs are non refundable."], "train_725": ["Customer is complaining about the damage shoes.", "Agent suggested to contact original retailer for return/exchange policy and also states that they can opt the option of filling claim."], "train_726": ["The customer is complaining that creamsoda in desperately short supply and not satisified.", "The agent advised all the products are subject to availability."], "train_727": ["The customer says he has ordered a phone in an instalment and paid all the taxes but still he has not yet received the phone.", "The agent asks when did the customer ordered the phone and says that customer will know that the phone is shipped when the card is charged."], "train_728": ["The customer is complaining that what will you do if there are no enough pilots to fly.", "The agent answered that as of now flights are scheduled and they have avoiding cancellations."], "train_729": ["Customer is complaining  about the idea network which is worst in their area from last 3 days.", "Agent says to specify your exact concern, so that  can assist better."], "train_730": ["Customer is complaining about charging twice for the same order.", "Agent updated the customer to DM them with store details and order number and also inform that they will forwarded to concerns team."], "train_731": ["Here Customer complained that after updating all the apps ios is not working properly so  he is asking how to fix it.", "Here agent ask to  update   all app available on device hence it wont resolve the issue so agent ask customer to message him on app after that he can look after to resolve the actual issue."], "train_732": ["The customer is seeking help for an alarm that goes off every day on Watch 3 and he says that isn't listed in the alarms and he asked siri to clear out all the alarms but she says there are none.", "The agent asks to restart both the phone and the watch and asks to DM the results of the restart."], "train_733": ["Customer is requesting for assistance in accessing his moms account.", "Agent state that it could be done if the account gets moved to customer's name or by having log in info from his mother."], "train_734": ["The customer says that he is trying to subscribe to WordPress plan but the load isn't getting finished and adds that his order processed twice with different order numbers and requests cancel one of them.", "The agent asks for the domain name used to open service and informs that they will take a look and attempt to place the order and adds that they will remove the additional order."], "train_735": ["Customer is unable to play music in spotify  music app.", "Agent ask customer to logout from app and restart the phone and login back again."], "train_736": ["The customer is complaining that he was unable to upgrade or change his seat even after paying the amount of $34.", "The agent confronted the customer saying that they will inform the wifi partners regarding the trouble that he was facing."], "train_737": ["Customer is complaining about call that has been not connected after calling many time.", "Agent informed the customer that the complaint was raised regarding network issue  but it has been resolved and informed that if any other concern they will assist for further."], "train_738": ["Customer is requested to process his case number is 00197387.", "Agent informed that they having some internal issue which is causing delay and  updated that they will informed once the case is processed and completed, Finally inform the customer that they will assist via DM."], "train_739": ["Customer is complaining about the corrupted external hard disk.", "Agent states that the drive may be nonfunctional."], "train_740": ["The customer is saying that Animoji's are being sent as pictures from his phone and says its resolved after some time.", "The agents asks whether Animojis are recording before sending the messages, what version of iOS is installed and asks to DM."], "train_741": ["Customer having an issue with card payment with 16-25 railcard on the  train.", "Agent asked for the station name and updated that in that station has both ticket office and TVMs. Finally check with customer whether he is able to purchase a ticket without railcard."], "train_742": ["Customer is asking that is there a way to find a tv guide to find whats on.", "Agent updated that new episodes are made available day after air for live TV subscribes."], "train_743": ["Customer is complaining that how to change GRS replication to LRS.", "Agent updated that they have alerted the team and they will respond."], "train_744": ["Customer is complaining that they are planning to hold flight to LGA for a bunch of them stuck on DC tarmac in aa5573.", "Agent updated although they can't make any promises they'll do all they can to assist."], "train_745": ["The customer is complaining that ont box has red with lights on.", "The agent asked to hold the alarm silence for or reset button for 15 seconds."], "train_746": ["The customer is asking whether there is any way to check the record PE558R as currently they are being blocked to do online check-in, they are experiencing error like \"Access to this booking has now been prohibited due to too many unsuccessful attempts\".", "The agent asks to DM any reference, customer's full name, home and email address and the details of the query and asks to contact them on Twitter for further assistance."], "train_747": ["Customer is complaining that he is trying to download the game but its getting stop on 87 to 99 percent what to do.", "Agent updated that to leave the console be until that finishes and let us know if it does not finish up by tomorrow."], "train_748": ["The customer is complaining that he has waiting from past 3 hours for a maintaince crew.", "The agent says that they will send updates to the customer."], "train_749": ["The customer is complaining that they can't get netflix due for me.", "The agent asked to continue conversation via dm."], "train_750": ["The customer is complaining that his music player not functioning properly and they won't let them to pause it.", "The agent asked to dm their user name or email address."], "train_751": ["Customer is asking help to hp support for having computer problems.", "Agent asking about issue and telling him to send a private message for better aasistance."], "train_752": ["The customer had placed an item and it about it deliver but unfortunately it stuck in fulfilment centre.", "The agent was asking the customer on which steps under does he gone through respective to his parcel."], "train_753": ["Customer is unable to checkout groceries.", "Agent request to DM full name and full address for their IT team to investigate further."], "train_754": ["Customer is inquiring about the cost for purchasing the cargo allowance.", "Agents suggests to go through an URL he shared to check the rate."], "train_755": ["Customer is saying that is it difficult o remove the tab from 4 pint containers of milk without using a sharp implement.", "Agent asked the customer to share the photo of barcode and DM the Nectar card number using the link."], "train_756": ["Customer is asking help that with Xbox one x pre orders had no confirmation about the dispatch.", "Agent updated to DM them the order details."], "train_757": ["Customer complaints on dealy of train b/w  warring ton to london .", "Gent is suggesting customer check  with help of url link for the compensation."], "train_758": ["Customer complains about eBay services.", "Agent updated the customer to check the URL for further assistance."], "train_759": ["Customer is complaining that his internet connection is fine and they have zero problems streaming shows.", "Agent suggest that they will definitely recommend reaching out to their team so they can take a closer look."], "train_760": ["Customer is complaining about drained battery when his MacBook pro was on sleep.", "Agent is requesting for the detailed information for resolving the issue."], "train_761": ["Customer is having an issue with Norton VPN app.", "Agent informed to check with different location and asked to DM for further assist."], "train_762": ["Customer is having an issue to send a medical records.", "Agent updated that there support team will look into this issue and asked the customer to DM with email address."], "train_763": ["Customer is asking for the help that he is delayed at Preston but he need to catch his connection at crewe.", "Agent updated that to claim for the delay by visiting the train operators website."], "train_764": ["Customer is asking that the deal with the weak random in playlists.", "Agent updated that they will take a time to reach out with the solutions."], "train_765": ["The customer says that he have a problem since halo 3 goes retrocompatible, he's not able to install the game and he have it.", "The agent asks whether the customer owns the game on disc or digitally and suggests to install it, and asks whether he is getting any error messages and shares a link which have the additional options for him to get the issue resolved."], "train_766": ["The customer enquires about the 5GB at 500frs offer and asks to \"Promote\" again.", "The agent informs that was a promotion and the promotion has ended."], "train_767": ["Customer is complaining about the poor system and equipment where they are getting only 13 channels.", "Agent recommend to speak with business class department and also request to reach out to them on anytime for further assistance."], "train_768": ["Customer complains about wifi network system.", "Agent suggests customer to chat with the Agent with provided link."], "train_769": ["Here customer is complaining about the apple phone get freezes if he uses the  the cable without adaptor.", "Here note down the issue and ask the customer to follow the steps  and takes the details and tells the customer to message him to get better assistance over it."], "train_770": ["The customer is complaining that he was about the services but no one is reponsing.", "The agent asked them to call at 1-800-837-4966 for cancellation and asked to call them at mo."], "train_771": ["Here customer is having some issue where router light are not working properly and he want a solution.", "Here agent tells to follow steps for better troubleshooting and then tells him to message him and stay connected for the better solution."], "train_772": ["Customer is saying that DVR does not record any of the thursday shows.", "Agent updated that there is a need to change a box due to missed recording folder."], "train_773": ["Customer is complaining about the iPhone  that battery dies fast and phone always is freezing up and end up having to wait like 15 minutes for it to get unfreeze.", "Agent says to install newest IOS 11.1 updates to help :URL let knows if this helps improves these issues."], "train_774": ["The customer says he paid for an item and seller told him that they cannot send for 2 to 3 months.", "The agent replies that the customer have 30 days from the estimated delivery date to file a claim."], "train_775": ["The customer asks whether any update on restoring cable/internet to Warren RI.", "The agent replies they are waiting on restoration of commercial power and they will inform if they find any other."], "train_776": ["Customer is enquiring about follow up of the complaint that he raised.", "Agent informed that they will forward the case to relevant team."], "train_777": ["Customer enquires how to send the funds to different user on ps4.", "Agent replied that once the funds are transferred to their account they cannot transferred to other account."], "train_778": ["Customer complains that they are unable to transfer the music to the phone.", "Agent asks to DM for further conversation."], "train_779": ["Customer did not get the cashback offer on iPhone 8. So, the customer is complaining about the service provided by the amazon.", "Agents states that the applicable promotions and offers are mentioned on the product details page and requests to follow the link he shared."], "train_780": ["Customer not able to delete the notifications on AppleSupport homepage all at once.", "Agent updated the customer to DM them about the issue and they will work on it."], "train_781": ["Customer complaining about the amazon service.", "Agent updated the customer to check the URL."], "train_782": ["Customer is enquiring about the repealing of net neutrality and reestablishment of light-touch regulation for consumer protections.", "Agent states that they haven't made any changes with the intent to deceive customers and have realized the importance of customers content choice."], "train_783": ["Customer is having an issue with slow network and data consuming in his hometown.", "Agent updated that when roaming there is 500MB data roaming limit that's the reason for slow down in your hometown."], "train_784": ["Customer is complaining about the app as she logged in she finds more number of garbage.", "Agents updated her that he will share the feedback with the team."], "train_785": ["Customer is disappointed for the delay of the products for two days.", "Agent is updating her to keep an eye on the mails and to keep them in a loop."], "train_786": ["Customer is unable to listen to kendrick lamar's album in SpotifyCares.", "Agent updated the customer to send the device version, Spotify version and URL of the alumb link and  DM the username and email address."], "train_787": ["Customer is complaining that he is unable to play the songs in queue on Spotify app and it stops after playing 1 song.", "Agent requests for the details about the device, operating system and the Spotify version. Also suggests to follow few steps by sharing an URL."], "train_788": ["Customer is complains about not getting the amex hilton surpass sign-up bonus for 3 months.", "Agent updated that the account has been remediated and see within 24-48hrs."], "train_789": ["Customer is complaining about the internet and wifi service issue.", "Agent is asking to reset battery back up and to reach out for further assistance."], "train_790": ["Customer is complaining about the experience he had with com cast and unwilling to provide details since he had communicated over phone already.", "Agent requests for the details and states that he can reach out anytime for further assistance."], "train_791": ["Customer is concerned he/she may lose PHX flight from DFW since delayed flight at BTR to DFW.", "Agent assures they will be leaving soon and requests to check with their airport team upon arriving at DFW."], "train_792": ["Customer is telling that the he was informed during the check in that guitar should be carried out in hard case but not informed earier.", "Agent is replying that they will try to allow it to store in cabin for that particular travel."], "train_793": ["Customer is enquiring about how to upgrade to premium because he didn't find any option in the iOS app.", "Agent states it isn't possible to upgrade within the app and where he can upgrade by sharing an URL."], "train_794": ["Customer is complaining about advertising a product as available when its actually not available.", "Agent informed the customer that the product is out of stock and inform to send the cat number along with post code by that they will come to know when the stock is available."], "train_795": ["Customer enquired about check-in issue.", "Agent updated to give some feedback and they will get back."], "train_796": ["Customer is concerned about the package he requested for return which has not picked up yet even after 1 month.", "Agent requests to share his details in the provided link and they will sort it ASAP."], "train_797": ["Customer is asking to rectify the issues he had with getting his priority pass set up.", "Agent states that the enrollment requests are not available and the customer can use his airline free credit for airport lounge passes."], "train_798": ["Customer is complaining that he isn't able to access hie prime video account on his Europe trip.", "Agent states that the prime video content availability is based on geo-location."], "train_799": ["Customer is complaining about the delivery agents for not taking the bed/mattress upstairs and says the website is misleading.", "Agent states if they are not insured to take the items upstairs and requests for the order number for further assistance."], "train_800": ["Customer is complaining about the disruption and delay in the scheduled journey.", "Agent explains it's due to an emergency incident and requests to claim the compensation by sharing an URL."], "train_801": ["Customer is asking about the blocking of bitcomet site due to which customer is unable to download the latest version.", "Agent asked the URL from the customer in which customer is trying to reach out the site."], "train_802": ["Customer is complaining that he is unable to access $$ from the ATM out of country.", "Agent is asking about the personal information of the customer and PIN details. Agent also provided URL to login."], "train_803": ["Customer complains about the fault appearing in photoshop like like exporting JPG files.", "Agent have passed the information of the issue to their experts so that the issue could get resolved ASAP."], "train_804": ["Customer complains about the damaged suit and laptop due to the spillage of drink by the flight attendant.", "Agent requests to submit a formal complaint with the onboard flight leader and states that the baggage office will review it once it is filed."], "train_805": ["Customer is complaining about the product which is not delivered on time..", "Agent informed to provided the details on URL and their support team will work on it."], "train_806": ["Customer is complains about spotify apps not working properly.", "Agent asked the customer android details, spotify version and informed to look backstage."], "train_807": ["Customer is complaining about the self service ticket machines which did not allow to select super off peak.", "Agent is requesting for the details about station, staff at the station and the journey to report it properly."], "train_808": ["Customer is complaining about the product he purchased by sharing an URL for additional details.", "Agent requests for the personal details along with postcode, barcode, sc code and price to send a moneycard as a refund."], "train_809": ["Customer having an issue with PC which automatically shut down often.", "Agent updated to send the Windows version and the short video clip of the actual issue and informed to contact Answer Desk Team by providing the URL."], "train_810": ["Customer complaining about the AmericanAir service.", "Agent updated the customer to  DM the number next to the baggage charge or can reach out directly."], "train_811": ["Customer is complaining to amazon about the motog5s plus phone where the dust in camera.", "Agent request to share the order details."], "train_812": ["Customer is complaining that he hasn't received his payments which had to be the instant pay.", "Agent requests for the email address and phone number for further assistance. Also states to check the mail and follow up with the team reached out to him."], "train_813": ["Customer enquired about cash back of 20% not return from Amazon.", "Agent updated that the Team will get back and asked the customer to check the email corresponds to it."], "train_814": ["Customer is enquiring about the denied access to one of their family members when tried to view the website.", "Agent requests to try using different browser and states to set the right limits by following the steps from shared URL."], "train_815": ["Customer is complaining about the late arrival of the amazon prime packages.", "Agent updates to provide the details to the nearest convenience."], "train_816": ["Customer is complaining about the sudden price increase.", "Agent informed the customer that the pricing and offers are the decision of the sellers and  also informed that he will pass the information to the concerned team."], "train_817": ["Customer is complaining that he cannot run the Spotify app in the background when using other apps even after restarting the phone.", "Agent requests for the email address along with the version details of Andoid and Spotify app."], "train_818": ["Customer wants to know which store is central scotland as the gyle, granton, ferry road, livingston and bathgate are the five places where customer had tried to find.", "Agent informed the customer that they will inform the hunters and also informed that the curries are provided in first comes first serves order."], "train_819": ["Customer is concerned about the aerosol product which has no age restrictions.", "Agent is updating him to DM his full name & amp, address so that they can logged and reviewed."], "train_820": ["Customer is complaining about the delivery experience with mychoice.", "Agent shared an URL and requests to provide the tracking number."], "train_821": ["Customer is not happy with the 6 weeks waiting time for its delivery once pre-ordering a device.", "Agent states that it is an estimated delivery time and will reward their patience with the airtime credit."], "train_822": ["Customer is complaining that they weren't informed by the staff about the rest room for the disabled passenger which was 3 carriages away.", "Agent is about the response from the onboard staff about the issue and they would help accordingly."], "train_823": ["Customer is complaining that one whole team is cheating in the game.", "Agent is assuring that in-game reports will be reviewed  by the studio and appropriate action will be taken."], "train_824": ["Customer is complaining that he is unable to make the payment by logging into paypal with both wifi/mobile data.", "Agent is requesting for the code and eBay app version number and escalated the issue to the tech team."], "train_825": ["Customer wants to renew the contract and wants to speak with  same person  that he was spoke previously.", "Agent informed they will look into the renew plan and inform to send the account information, DM,phone number and address."], "train_826": ["Customer is complaining about the bank staff who were wandering around instead of helping the customers.", "Agent requests for the location details of the bank to share it with appropriate parties for resolving the issue."], "train_827": ["Customer enquires about the Delta Flight timings reschedules.", "Agent updated all the timings of the Flight which is convenient for the customer."], "train_828": ["Customer is enquiring about the delayed delivery and false email which states that the product is delivered.", "Agent requests to contact them by phone or chat and to check with the neighbours or any safe locations around the property."], "train_829": ["Customer is complaining about amount has been deducted from bank account but received the email  transaction is unsuccessful.", "Agent updated that booking is confirmed with payment."], "train_830": ["Customer is complaining that they are racially abusing migrants who trusted them with their funds.", "Agent request to provide full name/zip/phone#/account type so that the social care team can assist them."], "train_831": ["Customer enquires that an echo plus act can work as a auxilary speaker when viewing streaming content.", "Agent updated him to get in touch with echo team for further assistance."], "train_832": ["Customer is complaining why crosses has been removed from the church.", "Agent updated that he would aware of this issue and are already in process."], "train_833": ["Customer is explaining about the problem with his TV and the connections, also he states that the initial download is in progress from past 2 hours.", "Agent requests to reset the connections and reboot the downloading. Also he suggests to reply if the issue persists even after resetting the coax connections."], "train_834": ["Customer complaining about the order that he has made in Amazon.", "Agent updated that to fill the form in the provided URL and their team member will look in to it."], "train_835": ["Customer is telling  how T-mobile has the best service than AT&amp.", "Agent is happy to hear the response from the customer."], "train_836": ["Customer is complaining about the not responding via twitter message.", "Agent informed the customer to call on private number so that they can take any action on account."], "train_837": ["Customer is complaining about the app crashing issue and iOS update  sucks.", "Agent asked to delete and reinstall the applications. Agent has also provided the URL."], "train_838": ["Customer is not happy with how the marketing is done by Idea network.", "Agent requests for the contact number for better assistance in resolving the issue."], "train_839": ["Customer is concerned about the package he requested for return which has not picked up yet even after communicating with the customer executive from past 15 days.", "Agent requests for the personal details over the secure link he shared and assures they would rectify it soon."], "train_840": ["Customer is complaining that the Spotify website player is crashing whenever tried to play the songs.", "Agent suggests to use a different web browser, incognito window and states to enquire with IT team for any restrictions they have put."], "train_841": ["Customer is complaining about the inconvenience of the transportation.", "Agent is looking for the renovations and available options and to workarounds."], "train_842": ["Customer is stating the error in the chanel.", "Agent updated that it is due to associated signal issue."], "train_843": ["Customer is seeking help to port forwarding to open customers NAT type and reset customer's UPnP.", "Agent provided URL and asked customer to find a list of Xbox live ports through which NAT can be opened."], "train_844": ["Customer is complaining about the interaction he had with the executives when he last visited to the nearest idea store.", "Agent is requesting to provide additional information regarding the idea store to assist better with the issue.f."], "train_845": ["Customer has updated iOS but it is not compatible with spotify6 and customer have also stated that it is unable to login facebook account.", "Agent asked the customer about the version of spotify app to resolve the issue."], "train_846": ["Customer is complaining about the buffering issue when streaming a live program.", "Customer requests to reboot the device and modem/router, further he is requesting for the additional clarification about the issue."], "train_847": ["Customer is enquiring about the Sainburys URL.", "Agent informed that they can't comment on other brand products."], "train_848": ["Customer wants to know why he is losing the flights he collected once the tier point ends and.", "Agent said that they would sometimes amend the terms & conditions of the executive club."], "train_849": ["Customer is complaining that there is only one alcoholic drink rule in first class and a hubble telescope portion for dinner.", "Agent is asking whether he has mentioned this to the team en route."], "train_850": ["Customer enquired about, Is  O2 having an offer a personal hotspot on payg sims.", "Agent updated that Our pay and Go packages not supports personal hotspot and inform to send the screenshot and phone details for further advise."], "train_851": ["Customer is saying that there is no money in the account and not to swap. Customer is using slang language as well.", "Agent is asking customer's account number. Since the customer is unhappy."], "train_852": ["Customer is having trouble to find the add new listing option and states that he would update to the latest versions as soon as it is available.", "Agents requests to update to the latest version and to provide additional details to assist better."], "train_853": ["Customer is complaining about the rejected application every time.", "Agent requests for the additional details along with the alternate numbers."], "train_854": ["Customer is complaining that he unable to configure his Xbox elite controller in the app.", "Agent is suggesting various methods to solve the issue and requests him to follow the guided steps to connect by sharing an URL."], "train_855": ["Customer is complaining about the lost downloaded songs on Spotify app.", "Agent wants to know whether the phone has any cache clearing apps and the storage location of the songs, also requests for the Spotify app version."], "train_856": ["Customer is complaining about the delay in delivery of his product and he wants his credits back for late delivery as per agreement.", "Agent updated that during busy period some deliveries may slightly delay and informed the customer to send the URL for look into the issue."], "train_857": ["Customer is telling that he is not making his connection from preston to penrith as his train from liverpool's got late.", "Agent  updated  that once he arrive at preston, he can speak to station staff who can assist further."], "train_858": ["Customer is enquiring about the tickets which is messed up because of the complaint she made.", "Agent updated her to work with the airport team directly."], "train_859": ["Customer wants to contact a member from talent team to enquire about the status of his job application, and states that he tried to contact recruitment team and didn't get any responses.", "Agent requests for the details of the applied jobs so that he could share it with the recruitment team."], "train_860": ["Customer wants to contact with an agent and tried calling the store but ended with no response.", "Agent provides the 2 contact numbers to try out and requests for the details about the issue to resolve it."], "train_861": ["Customer is complaining about the restriction he had when flying American Airlines which weren't there when he flew last time.", "Agent states that he has purchased a basic economy fare and the details on the restrictions were in the popups."], "train_862": ["Customer is enquiring about the router which is not getting print even though after changing IP address.", "Agent is happy for customer response and asking them to reach out for further assistance."], "train_863": ["Customer is enquiring about the schedule of Virgin trains during off peak times between WGS and EUS on 27/12/17.", "Agent states that off peak is all day and the restrictions are lifted in the morning."], "train_864": ["Customer is complaining that he cannot run the Spotify app in the background when using other apps even after restarting the phone.", "Agent requests for the email address along with the version details of Andoid and Spotify app."], "train_865": ["Customer enquired about the flight and asked some contact details.", "Agent asked the customer details."], "train_866": ["Customer is complaining about the experience with the amazon help on the phone who do not takes notes on prior calls.", "Agent updated that registries department has limited phone support hours and also stated to let them know what information was provided when they receive a call back."], "train_867": ["Customer is stating that it is unable to download fishing planet.", "Agent provided URL to the customer and asked to restore the playstation."], "train_868": ["Costomer is complaining that the statement is generated which is still the same.", "Agent  is telling that Rachael is currently out of the office and she will contact him when she is back."], "train_869": ["Customer is complaining as they have received the message by stating that they said mean things and abusive to another member.", "Agent is updating  to view enforcement actions and can submit a case review."], "train_870": ["Customer is complaining about his last two runs are not sinking from tom tom and have tried logging in again.", "Agent updated to drop them a DM with their nike plus email and have provided the URL."], "train_871": ["Customer is telling that its not his fault as that people stole the mail & apm and they put  a metal monstrosity in front with  a package box.", "Agent is asking who is the carrier assigned to this delivery so that they will b more happy to assist them."], "train_872": ["Customer is complaining about iphone 7 which  has screen bleeding issue in few days out of warranty .", "Agent updates that they will get back to them in DM shortly."], "train_873": ["Customer is complaining that his Lumia 950 is constantly uploading something even after restricting background usage with both WiFi and metered connection.", "Agent suggests to reset the device by following the steps on the provided link and requests to back up the device before proceeding with a hard reset."], "train_874": ["Customer is  enquiring about returing an item.", "Agent updates the customer to return the item, if its not been opened."], "train_875": ["Customer is complaining that Opticians are not attending to him as per the appointment.", "Agent assures that it wasn't intentional and has been escalated to manager to investigate, also states that he will receive a response within 72 hours."], "train_876": ["Customer is complaining about the issue with filling the form to order a new SIM.", "Agent requests to try with the alternate browser for the process and suggests to use Mozilla Firefox."], "train_877": ["Customer is asking how to remove expired subs from mynorton?", "Agent is updating him to sign out/sign in again after few hours to check if this stil happens."], "train_878": ["The Customer is complaining about the service that the Assistant manager did not help them.", "Agent is seeking the customer's details to resolve the issue."]}